{"corpusid":208605629,"openaccessinfo":{"externalids":{"MAG":"2977278554","ACL":null,"DOI":null,"PubMedCentral":null,"ArXiv":null},"license":null,"url":null,"status":null},"abstract":"Bacteriophages, or phages, are viruses that infect bacteria, at the end of their life cycle produce a set of enzymes called endolysins to lyse host cells from within, facilitating the release of the viral progeny. Due to their lytic activity, endolysins have gained great interest as potential antibacterials targeting both Gram–positive and –negative bacteria, especially in the actual context of increasing rates of antibiotics resistance. This approach relies on the observation that external application of recombinant endolysins (enzybiotics) can efficiently lyse target bacteria from without. The current thesis explores the potential of two groups of endolysins, peptidoglycan hydrolase and mycolylarabinogalactan esterase as potential antibacterials. The peptidoglycan hydrolases hydrolyze glycosidic and amide bonds in the peptidoglycan layer of the bacterial cell wall, while mycolylarabinogalactan esterases hydrolyze the ester bond between mycolylarabinogalactan and peptidoglycan in mycobacterial cell wall.Different strategies for immobilization of the well–known peptidoglycan hydrolase, lysozyme from T4 bacteriophage and its antibacterial activity was studied. Immobilization of the T4 lysozyme (T4Lyz) to wound dressing gauze in a single facile binding step was achieved through engineering the endolysin with a cellulose binding module (CBM) as a fusion tag. T4Lyz–CBM–immobilized gauze retained antibacterial activity against Gram–positive Micrococcus lysodeikticus (3.8 Log10 reduction) and Gram–negative Escherichia coli and Pseudomonas mendocina with 1.59 and 1.39 Log10 reduction, respectively.In another approach, the antibacterial activity and storage stability of the T4Lyz as well as Hen Egg White Lysozyme (HEWL) were enhanced via covalentimmobilization to tailored positively charged aminated cellulose nanocrystals (Am–CNC). Am–CNC–lysozyme conjugates retained muralytic activity of 86.3% and 78.3% for HEWL and T4Lyz, respectively, and also showed enhanced bactericidal activity with MIC (minimum inhibitory concentration) values of 62.5, 100, 500 and Structure alignment showed that LysB enzymes are not true lipases due to the lack of the lid domain which was confirmed by testing the esterase activity of LysB–D29 against para–nitrophenyl butyrate (pNPB) in presence and absence of Triton X–100 as a surfactant. Unlike true lipases, LysB–D29 has higher enzymatic activity in the absence of Triton X–100 and hence does not require interfacial activation. Moreover, some LysB homologs with varying degrees of similarity to LysB–D29 were cloned and recombinantly expressed in E. coli BL 21 (DE3) expression host. Characterization of their kinetic parameters for the hydrolysis of para–nitrophenyl ester substrates showed LysB–His6 enzymes to be active against a range of substrates (C4–C16), with catalytic preference for para–nitrophenyl laurate (C12). The mycolylarabinogalactan esterase activity for hydrolysis of mycolylarabinogalactan–peptidoglycan complex as substrate for the LysB–His6 enzymes was confirmed by mass spectrometry. Extracellular application of LysB–His6 enzymes against Mycobacterium smegmatis resulted in marginal antibacterial activity but combining the enzymes with half MIC (1 μg/ml) of colistin (outer membrane permealizer) enhanced the antibacterial activity. 625 μg/ml against M. lysodeikticus, Corynebacterium sp., E. coli and P. mendocina, respectively. The Log10 reduction of the tested bacteria occurred in a relatively shorter time and disruption in the cell envelope morphology was observed. The immobilized preparations further exhibited enhanced storage stability compared to the free enzymes. The mycolylarabinogalactan esterase Lysin B (LysB) is produced by mycobacteriophages that infect mycobacterial cells that possess a unique cell wall structure with a thick mycolic acid layer. The genome database of mycobacteriophages was explored to find and categorize LysB enzymes based on similarity to LysB–D29, the only LysB with available crystal structure. Comparative structural analysis of some novel mycobacteriophage LysB enzymes resulted in homology modelling of 30 LysB proteins differing in their similarity to LysB–D29. (Less)","updated":"2022-01-31T18:04:02.146Z"}
{"corpusid":228729757,"openaccessinfo":{"externalids":{"MAG":null,"ACL":null,"DOI":null,"PubMedCentral":null,"ArXiv":null},"license":null,"url":null,"status":null},"abstract":"Definition. A function from ω to ω (m ≥ 0) is called recursive (or computable) if it is obtained by finitely many applications of the following rules: R1. • I i : ω → ω, 1 ≤ i ≤ n, defined by (x1, . . . , xn) 7→ xi is recursive; • + : ω × ω → ω and · : ω × ω → ω are recursive; • χ< : ω × ω → ω is recursive. R2. (Composition) For recursive functions G,H1, . . . ,Hk such thatHi : ω n → ω and G : ω → ω, F : ω → ω, defined by","updated":"2022-01-27T01:50:42.129Z"}
{"corpusid":236841321,"openaccessinfo":{"externalids":{"MAG":null,"ACL":null,"DOI":null,"PubMedCentral":null,"ArXiv":null},"license":null,"url":null,"status":null},"abstract":"Organic FertilizersAgrochemicals Detection, Treatment and RemediationThe Indian Nitrogen AssessmentAdvances in Nano-Fertilizers and Nano-Pesticides in AgricultureBiofertilizers in Indian AgricultureAdvances in Applied MicrobiologyProbiotics and Plant HealthChitin-ChitosanThe Complete Technology Book on Biofertilizer and Organic Farming (2nd Revised Edition)Effects of Organic Fertilizers on Growth and Yield of CorianderBiofertilizers TechnologyMicrobial EndophytesEffect of Bio-fertilizers and Growth and Yield of SunflowerCadmium Toxicity and Tolerance in PlantsMicrobiota and BiofertilizersHandbook of Microbial BiofertilizersManufacture of Biofertilizer and Organic FarmingPGPR Amelioration in Sustainable AgricultureClimate Change and Agricultural EcosystemsEffect of seed treatment, nitrogen fertilization and herbicide application on the efficacy of bio-N on corn (zea mays L.) growth and productivityAutomation in AgricultureEvaluation of Turmeric Cultivars and Studies on the Effect of Bio-fertilizers, Macro and Micronutrients on Turmeric (Curcum Domesfica Vol) Cv. DK LocalBiofertilizers for Sustainable Agriculture and EnvironmentIntegrated Nutrient Management (INM) in a Sustainable Rice-Wheat Cropping SystemBiofertilizers and Biopesticides in Sustainable AgricultureSustainable Agriculture in the Era of Climate ChangeInm on African MarigoldPhysical Methods for Stimulation of Plant and Mushroom DevelopmentRecent Advances in Biofertilizers and Biofungicides (PGPR) for Sustainable AgricultureSustainable Crop ProductionControlled Release Fertilizers for Sustainable AgricultureBiotechnology for Sustainable AgricultureBiofertilizersNitrogen in Agricultural SystemsThe Complete Technology Book On Bio-Fertilizer And Organic FarmingPhytomanagement of Polluted SitesSeaweed in Health and Disease PreventionFood Waste to Valuable ResourcesMycorrhizal Technology in AgricultureMolecular Aspects of Plant Beneficial Microbes in Agriculture PGPR Amelioration in Sustainable Agriculture: Food Security and Environmental Management explores the growthpromoting rhizobacteria (PGPR) that are indigenous to soil and plant rhizosphere. These microorganisms have significant potential as important tools for sustainable agriculture. PGPR enhance the growth of root systems and often control certain plant pathogens. As PGPR amelioration is a fascinating subject, is multidisciplinary in nature, and concerns scientists involved in plant heath and plant protection, this book is an ideal resource that emphasizes the current trends of, and probable future of, PGPR developments. Chapters incorporate both theoretical and practical aspects and may serve as baseline information for future research. This book will be useful to students, teachers and researchers, both in universities and research institutes, especially working in areas of agricultural microbiology, plant pathology and agronomy. Presents new concepts and current development in PGPR research and evaluates the implications for sustainable productivity Describes the role of multi-omics approaches in establishing an understanding of plant–microbe interactions that help plants optimize abiotic stresses Incorporates both theoretical and practical aspects, and will serve as a baseline for future researchThe Indian Nitrogen Assessment: Sources of Reactive Nitrogen, Environmental and Climate Effects, and Management Options and Policies provides a reference for anyone interested in Reactive N, from researchers and students, to environmental managers. Although the main processes that affect the N cycle are well known, this book is focused on the causes and effects of disruption in the N cycle, specifically in India. The","updated":"2022-01-27T02:57:50.432Z"}
{"corpusid":224174804,"openaccessinfo":{"externalids":{"MAG":"2563718884","ACL":null,"DOI":null,"PubMedCentral":null,"ArXiv":null},"license":null,"url":null,"status":null},"abstract":"语言学习者的听、说、读、写、译任何一项技能的大幅度提高都离不开对词汇的充分掌握。词汇是语言学习中非常重要的组成部分,词汇教学如今却受到了越来越多的重视。当前初中英语词汇教学中,学生被动地接受词汇,费时低效,既不能激发学生学习词汇的兴趣,也不利于培养学生的英语学习能力。如何帮助他们记忆、理解、搜索和使用词汇是一个重要的课题。近年来,在词汇教学中一个崭新的教学理论一词块理论逐渐进入研究者们的视野。词块教学在英语教学中的作用也受到了语言学家和语言教学专家的广泛关注。词块是兼有句子和词汇特征的固定或半固定的语言结构,这些模式化的词块以一个整体储存在人的大脑中,是语言处理最理想的单位。词汇组块的存在加快了语言处理的速度,对促进语言习得和语言输出的流利性都具有重大的意义。词块教学法强调培养学习者的词块能力,即掌握交流中频繁出现的固定词组、搭配和句型的能力,从而把词汇、语法的习得和交际能力的培养融为一体。然而,对词块教学的研究大多停留在理论探讨阶段,实证性研究比较少。本文对南京市第三十九中学初中七年级两个班的学生进行了词块教学能否提高学生学习词汇的能力以及它对初中英语教学是否有积极地影响的教学实验。作者在遵循学生认知规律、词汇学习策略和词汇教学理论的基础上,设计了一系列的活动指导学生识别、储存并运用词块,旨在提高学生学习词汇的能力,提高学习成绩。 本文介绍了此次研究的缘起和研究问题的背景,并阐述了研究的理论基础,和国内外目前对词块教学的研究现状,介绍了实验的过程,最后通过认真分析学生测试成绩、调查问卷和访谈情况,得出了以下结论:1)词块教学法学生是认可的,是行之有效的。2)学生的词汇学习观念以及词汇学习策略有了改进。3)词块训练能够提高提高学生正确使用词汇的能力。4)学生的词汇综合运用能力和英语学习成绩有了一定的提高。","updated":"2022-01-24T19:08:59.308Z"}
{"corpusid":178140299,"openaccessinfo":{"externalids":{"MAG":"1880120639","ACL":null,"DOI":null,"PubMedCentral":null,"ArXiv":null},"license":null,"url":null,"status":null},"abstract":"Este articulo presenta nuestros resultados de Investigacion en el modelado de una Escuela Agil en Ingenieria en la que se caracteriza: La transformacion de la ensenanza funcional (ensenanza jerarquizada y fraccionada a traves de cursos desintegrados sin estrategias claras de sincronizacion de contenidos) a la ensenanza por procesos (un enfoque sistemico e interconectado de cursos en el que el estudiante aprende y evoluciona utilizando estrategias aprendizaje, que obligan, la integracion de conocimientos a traves de ciclos de vida de desarrollo de productos o servicios). El desarrollo de competencias personales y de desempeno profesional coherentes con la gestion de portafolios, programas y proyectos de ingenieria, que buscan disminuir las brechas del ser, saber y hacer, de la experiencia profesional. La creacion de estrategias de integracion directas entre el aula de clase y el trabajo de campo y viceversa, entendiendo el proceso de transformacion entre lo empirico y lo teorico, como una accion de formalizacion ontologica (organizacional), epistemologica (conocimiento, conseguido al realizar experimentos para obtener prototipos y pilotos viables en el entorno) y metodologica, para crear practicas de valor anadido, eficaces y eficientes. La Integracion de la ensenanza-aprendizaje-investigacion, en la que los docentes en conjunto con sus estudiantes, realizan acciones de campo, procurando productos de conocimiento aprovechables para la mejora al interior de las instituciones educativas y el desarrollo del entorno social y productivo. La formacion de egresados, responsables por la mejora de las practicas actuales y la transferencia de nuevo conocimiento al entorno, como profesionales proactivos formados que los hagan en el momento de su egreso, profesionales de presente y de futuro respecto a la evolucion del entorno de la ingenieria, respondiendo asi, a un analisis comparativo permanente por parte de las instituciones responsables del servicio educativo. La creacion de estrategias de integracion directas entre el aula de clase y el trabajo de campo y viceversa, entendiendo que el proceso de transformacion entre lo empirico y lo teorico, es una accion metodologica para crear practicas de calidad, eficientes y eficaces.","updated":"2022-01-23T03:15:15.426Z"}
{"corpusid":224389607,"openaccessinfo":{"externalids":{"MAG":"1127697099","ACL":null,"DOI":null,"PubMedCentral":null,"ArXiv":null},"license":null,"url":null,"status":null},"abstract":"自1995年我国实行“双休日”以来，小学生每年处于休闲状态的时间总共有170天之多，接近全年的二分之一。然而，小学生的休闲教育在我国几乎还是空白，很少被提及。学校关注的只是给学生布置作业，要求学生按期、按质、按量完成假期作业。许多学生由于不会安排自己的休闲活动，在大量的休闲时间里无所事事，或是被家长“捆绑”进各种补习班，或是没完没了地看电视，上网，玩游戏机，或是漫无目的地闲逛，或是出入于不适合未成年人的休闲场所，学生的人身安全和思想道德上存在着严重隐患。如何安排好孩子的闲暇时间，促使孩子健康成长和发展，根据多年的教学实践谈谈我的几点看法。","updated":"2022-01-27T05:00:56.148Z"}
{"corpusid":201106375,"openaccessinfo":{"externalids":{"MAG":null,"ACL":null,"DOI":null,"PubMedCentral":null,"ArXiv":null},"license":null,"url":null,"status":null},"abstract":"The hygroscopicity of pollen species is not well-recognized. The authors investigated six different type of pollen particles using two methods. This work provides valuable dataset for hygroscopicity study community. I have two major comments, which should be addressed and implemented in the revised manuscript. Afterwards, I would like to review another round. (1) In 3.2.1 Theories, the authors assumed the pollen grains are spherical, then, build the link between kappa and mass hygroscopic growth. While, the pollen gains may not the case and are porous in real world. Assuming a spherical particle could lead to a big bias, for example, higher increase in mass, but, smaller hygroscopic growth in diameter. Actually, the mass growth is significant, but the kappa is very small value compared the atmospheric secondary organic aerosols. The authors","updated":"2022-01-27T06:45:47.527Z"}
{"corpusid":209758830,"openaccessinfo":{"externalids":{"MAG":"2597573023","ACL":null,"DOI":null,"PubMedCentral":null,"ArXiv":null},"license":null,"url":null,"status":null},"abstract":"In February 2013, it was announced that South Africa would be standardising the import requirements for cattle, sheep and goats from its associated Southern African Customs Union (SACU) nations - namely Botswana, Lesotho, Namibia and Swaziland (BLNS). The industry requested certain requirements to be waived for animals imported for direct slaughter or feedlot purposes. However, due to the lack of an effective traceability system in South Africa and in an effort to guard the country's disease status, all importers that wish to be eligible for the less stringent import requirements pertaining to cattle, sheep and goats imported from BLNS for direct slaughter or feedlot purposes, must adhere to certain procedures for the importation, movement, monitoring, recording and reconciliation of these animals.","updated":"2022-01-27T07:07:16.304Z"}
{"corpusid":201078541,"openaccessinfo":{"externalids":{"MAG":"3088387052","ACL":null,"DOI":null,"PubMedCentral":null,"ArXiv":null},"license":null,"url":null,"status":null},"abstract":"This paper reviews scientific advances achieved by a North-South network between 2006 and 2016. These scientific advances concern Solar Terrestrial Physics, Atmospheric Physics and Space Weather. In this part A, we introduce knowledge on the Sun-Earth system. We consider the physical process of the dynamo which is present in the Sun, in the core of the Earth and also in the regions between the Sun and the Earth, the solar wind-magnetosphere and the ionosphere. Equations of plasma physics and Maxwell's equations will be recalled. In the Sun-Earth system there are permanent dynamos (Sun, Earth's core, solar wind magnetosphere, neutral wind ionosphere) and non-permanent dynamos that are activated during magnetic storms in the magnetosphere and in the ionosphere. All these dynamos have associated electric currents that affect the variations of the Earth's magnetic field which are easily measurable. That is why a part of the tutorial is also devoted to the magnetic indices which are indicators of the electric currents in the SunEarth system. In order to understand some results of the part B, we present some characteristics of the Equatorial region and of the electrodynamics coupling the Auroral and Equatorial regions. © 2017 BBSCS RN SWS. All rights reserved","updated":"2022-01-27T09:07:22.908Z"}
{"corpusid":191866057,"openaccessinfo":{"externalids":{"MAG":"2307880704","ACL":null,"DOI":null,"PubMedCentral":null,"ArXiv":null},"license":null,"url":null,"status":null},"abstract":"Bir y??rede yap?? yapma k??lt??r?? ??zerinde etkisi olan ??ok say??da fakt??r vard??r. Bunlar plan tiplerinden, ta????y??c?? sistemlere, malzeme kullan??m??ndan, yap??m s??re??lerine farkl?? bir??ok boyutta yap??l?? ??evrenin in??as??n?? etkilemi??tir. Ancak Anadolu gibi hemen her yerle??im biriminde farkl?? zenginlikler ta????yan, ??e??itli geleneksel yap??m sistemlerini bir arada bar??nd??ran bir co??rafyada ne yaz??k ki bu ??e??itlili??in nedenlerini anlamaya ??al????mak kolay de??ildir. Bu ??al????mada, ??lkemizdeki vernak??ler mimarl??????n somut verilere g??re yap??lm???? ??e??itli s??n??fland??rmalar?? ele al??nacak ve bu s??n??fland??rmalar??n neden farkl??l??klar?? a????klayamakta yetersiz kald?????? tart??????lacakt??r.","updated":"2022-01-27T10:24:45.650Z"}
{"corpusid":209469743,"openaccessinfo":{"externalids":{"MAG":null,"ACL":null,"DOI":null,"PubMedCentral":null,"ArXiv":null},"license":null,"url":null,"status":null},"abstract":"The World Food Conference1974 resolved that the foo d security ensures adequate supplies and availabili ty. Food security has become a significant issue across the world predominantly in developing countries like In dia. In a report of International Food Policy Research Institute's Glob a Hunger Index, 2011, has declared India’s 67 th rank of the 81 countries of the world with the worst food security status. F ood security in the United Nation’s (UN) Developmen t Programmes original concept of human security has been conside red as one of the important factor along with econo mic, health, environmental, personal, community, and political s ecurity. The Purpose of the present joint paper is to emphasize the policies, issues and challenges for the food securi ty in relevance to India.","updated":"2022-01-27T12:56:35.251Z"}
{"corpusid":126223981,"openaccessinfo":{"externalids":{"MAG":"2779840956","ACL":null,"DOI":null,"PubMedCentral":null,"ArXiv":null},"license":null,"url":null,"status":null},"abstract":"PURPOSE: To simplify the functional calculation by calculating a distance band to be irradiated by an antenna and the difference of distance between the antenna and the interior of irradiation band, respectively, from the aperture angle and the angle of depression of the antenna and the length of a turning arm and the height of the antenna from the ground. CONSTITUTION: The inner end of a circular ring 4 irradiated with a band width SW is located at a distance RG1 . from the center of the projection of a helicopter on the ground. A correlation circuit 7 compares the real value of a signal received from a memory 26 for each distance to be considered with a corresponding value of a reference function and subjected to complex correlation. The correlation circuit 7 is introduced with each value of the distance to be considered as a predetermined value. When the length L of a rotor vane is very short as compared with the distance RG1 between the turning point of the antenna and the inner end of the irradiation band on the ground, functional calculation in a geometrical circuit section 10 is simplified.","updated":"2022-01-27T12:47:18.771Z"}
{"corpusid":146651486,"openaccessinfo":{"externalids":{"MAG":"2939399017","ACL":null,"DOI":null,"PubMedCentral":null,"ArXiv":null},"license":null,"url":null,"status":null},"abstract":"Disclosed are an ink cartridge ink level prompting method, an ink cartridge chip, and an ink cartridge. In the method, the ink cartridge executes the following processes: acquiring the remaining ink level of the ink cartridge on the basis of ink level data written into the ink cartridge chip by an imaging device connected to the ink cartridge; comparing the remaining ink level of the ink cartridge with a predetermined ink level threshold; and the ink cartridge simulating, on the basis of the comparison result, an output of an actual sensor for use in monitoring the ink level of the ink cartridge. As such, a generic ink cartridge without the actual sensor for use in monitoring the ink level of the ink cartridge can be provided, and compatibility of the ink cartridge with imaging devices is implemented at reduced costs.","updated":"2022-01-27T14:10:53.224Z"}
{"corpusid":222811452,"openaccessinfo":{"externalids":{"MAG":"2522562803","ACL":null,"DOI":null,"PubMedCentral":null,"ArXiv":null},"license":null,"url":null,"status":null},"abstract":"社会化紧急救援服务体系，是指在政府指导下，通过社会化和市场运作的方式，在应对自然灾害、突发公共事件、安全事故的过程中，动员社会资源和民间力量参与紧急救援所形成的服务体系。社会化紧急救援服务体系的内容广泛，主要包括：","updated":"2022-01-27T14:23:53.539Z"}
{"corpusid":200924962,"openaccessinfo":{"externalids":{"MAG":"2784913177","ACL":null,"DOI":null,"PubMedCentral":null,"ArXiv":null},"license":null,"url":null,"status":null},"abstract":"Cases4Real CUP Июль 2017 Фрагмуви уже тут! Начни оттачивать свой скилл уже прямо сейчас - принимай участие в ежемесячных турнирах Cases4Real CUP.","updated":"2022-01-27T19:41:39.028Z"}
{"corpusid":229925917,"openaccessinfo":{"externalids":{"MAG":"2255021992","ACL":null,"DOI":null,"PubMedCentral":null,"ArXiv":null},"license":null,"url":null,"status":null},"abstract":"中要求考核的四个能力,即理解能力、实验能力、理论联系实际能力、读懂资料的能力.理化生综合卷主要是\"拼盘\"形式,难度不大,但有一个矛盾非常突出,具体考到的知识点很少,而所占的分值很大,也不一定是课本的重点内容都会考到.这要求我们不能因考试的随机性而放弃复习的全面性,在整个复习阶段应注重知识的日积月累、透彻理解和灵活应用.只有踏踏实实地掌握基础知识,掌握基本技能,去掉一切侥幸心理,采用合适的复习方法,才能取得理想的成绩.下面是我连续二届高三生物复习的教学体会,供大家参考.","updated":"2022-02-07T22:50:55.145Z"}
{"corpusid":236069890,"openaccessinfo":{"externalids":{"MAG":"1619578774","ACL":null,"DOI":null,"PubMedCentral":null,"ArXiv":null},"license":null,"url":null,"status":null},"abstract":"These resources, both print and electronic will help you successfully complete your course assignments for the Trade Books courses. Children's Literature Resources","updated":"2022-02-07T21:06:12.151Z"}
{"corpusid":226505383,"openaccessinfo":{"externalids":{"MAG":"3059993334","ACL":null,"DOI":null,"PubMedCentral":null,"ArXiv":null},"license":null,"url":null,"status":null},"abstract":"Contempt for vulnerability is the defining characteristic of contemporary American conservatism. Conservatives ridicule diversity initiatives, government assistance, antidiscrimination policies, the #MeToo movement, worker protections, universal health care, family leave, forgiveness of student debt, and other progressive concepts as obsessions of the fragile and the dependent. The contempt for vulnerability has been on vivid display in the campus free speech crisis narrative, which bemoans the rise of “snowflake” students demanding safe spaces from conflict and discomfort. According to proponents of this narrative, snowflakes are dangerous as well as ridiculous, and their pernicious influence extends beyond college campuses. Conservative critics warn that “Antifa” and other extreme elements of the left seek to silence and disarm dissent everywhere, by force if necessary. There is truth in the dangerous snowflake narrative, but not the truth that its promoters think. It is true that impressionable individuals who are taught to fear ideas that they do not understand or people who disagree with them pose a threat to society. The danger is particularly acute when these individuals come together and develop a group identity based on their fears. When such a group decides that it is imperative to protect its identity at all costs, it becomes, in effect, a cult. But college students protesting controversial speakers or requesting content warnings are not that cult. Neither are progressives demanding accountability for sexual abuse, racist policies, or economic injustice. If there is a group truly determined to make the entire world into their personal safe space, no matter the cost, it is the self-identified Second Amendment activists too frightened to","updated":"2022-02-07T23:53:39.691Z"}
{"corpusid":190219036,"openaccessinfo":{"externalids":{"MAG":"126322721","ACL":null,"DOI":null,"PubMedCentral":null,"ArXiv":null},"license":null,"url":null,"status":null},"abstract":"Els objectius principals d’aquest projecte, l’analisi de requeriments es l’obtencio de les condicions i capacitats que ha de satisfer l’aplicacio per tal que les necessitats del client es vegin complertes per l’eina. Llavors aquest apartat tractara de: Obtenir tots els requeriments de l’usuari pel que fa a l’eina. Definir aquest requeriments mitjancant una descripcio completa de les necessitats. Validar els requeriments obtinguts i que s’han d’acomplir en el sistema final mitjancant l’aprovacio del tutor. Construir un cataleg de requeriments funcionals que serveixin com a pas previ per la definicio dels casos d’us.","updated":"2022-02-08T09:30:40.871Z"}
{"corpusid":186880211,"openaccessinfo":{"externalids":{"MAG":"51085870","ACL":null,"DOI":null,"PubMedCentral":null,"ArXiv":null},"license":null,"url":null,"status":null},"abstract":"espanolLa expresion gaita refleja el alma sensitiva de Galicia: es como su simbolo y tambien su sintesis. Y, como dijo el ilustre don Ramon del Valle-Inclan, el gaitero y su gaita son el alma de festas e romanxes. Las gaitas y los gaiteros son clasicos en la terrina meiga. Su genuino ambiente es la romaxe, denominacion que en la fiesta popular, lengua espanola, se denomina eufonicamente romeria. Vamos a ocuparnos brevemente, a recordar os romaxes que hace sesenta y mas anos vimos, asistimos a ellos por la tierra gallega. EnglishSuch are the features of the campaign at the so called by natives «Terrina Meiga» and without them something essential will be missing, beautiful Galicia would not be dreamed of. Without the sound of the bagpipe we will never hear the Muneira nor the ronco or snore, that characteristic sound of the instrument. But then of course the bagpipe player performs such a role!: He is the enlivener of country pilgrimages as don Ramon del Valle-Inclan used to say. When at this country walks, «romaxes», in a mixture of a mood made out of fervour and merriness the bagpipe player steps up or strides the rungs of the «cruceros» playing a fervid «fortissimo». So smart look the gacilian young women sprucely costumed and dancing at the harmonious sound of the timbreis. The stone crosses, the granaries built upon pilasters, the logan of rocky lanes figure among the most classical features spreading through the Galician countryside though they are not exclusive of this lands. These are so called «corredoiras, narrow or wide tracks through which the oxen carts go creaking their wheels all the way warning the coming fellows to wait at the side-tracks. Every bit of this together with the celetrated «Rias» (Fjords, Highland lochs) join to make Galicia a unique and charming country. francaisCe sont les elements de la campagne de la «terrina meiga», et sans eux il lui manquerait quelque chose d'essentiel, la belle Galicie n'existerait pas, comme si au son de la cornemuse n'avait pas vibre la «muneira», et le son rauque, si special, de la cornemuse galicienne. Mais la cornemuse a besoin du cornemuseur, l'ame des pelerinages, comme disait Mr. Ramon de Valle-Inclan, quand dans les pelerinages, le cornemuseur entonne la «muneira» avec vigueur. Les porte-croix, les greniers sur des piliers et les petits sentiers sont d'autres elements de la Galicie, meme si ceux-ci ne lui sont pas propres, ils existent dans bien d'endroits, et peut-etre les plus legitimes sont les petits sentiers, ees reduites entailles qui sont parfois de veritables fleuves et par lesquelles les charrettes de boeufs doivent chanter, grincer, pour prevenir les freres qui viennent en sens inverse pour qu'ils s'arretent dans les refuges. Tout ceci, uni aux celebres estuaires (rias) font de Galicie quelque chose d'unique, un beau et ravissant pays. DeutschDudelsack Dudelpfeifer, Schnellentrommel und Kirchweih, sind die Grundstoffe der Landschaft meines Heimetlandes und ohne diese Grundstoffe wurde etwas wesentlich fehlen tur der Bestand der schone Galicia. Der Dudelpfeifer ist der Geist von der Kirchweih, wie der Schriftsteller Ramon del Valle-Inclan schreibt, wenn vor der Kirchweih der Pfeifer seines Tonwerkzeug an der Kapelle spielt. Die Landkreuze, Kornboden, die Landstrasse und die Rias (Flussmundung) uberhaufen die Landschaft von der grunnen Galicia, auch so wie die Ochsenwagen die durch die enge Landstrassen mit dem langsames gehen mit dem Knarren seinen Rader fahren. Der Artikelschreiber durch seine Werke fuhrt einem Poetischengesang zu seiner Heimat Galicia mit bermerbarer Zauberheit.","updated":"2022-02-08T10:54:18.565Z"}
{"corpusid":183338288,"openaccessinfo":{"externalids":{"MAG":"2342044657","ACL":null,"DOI":null,"PubMedCentral":null,"ArXiv":null},"license":null,"url":null,"status":null},"abstract":"24 czerwca tego roku 56 policjantow (strzegących MON - \"obiektu NATO\") tylko sie bronilo przed atakiem manifestantow,","updated":"2022-02-08T12:26:40.398Z"}
{"corpusid":184440463,"openaccessinfo":{"externalids":{"MAG":"2434264061","ACL":null,"DOI":null,"PubMedCentral":null,"ArXiv":null},"license":null,"url":null,"status":null},"abstract":"今年以来,我省经济发展在新常态背景下,增长速度仍保持在合理区间,且运行良好,有些指标还处于全国前列,这都是省委、省政府审时度势,带领全省干部群众共同努力的结果。我们在肯定成绩的同时,也必须对存在的问题保持高度关注。一是高度关注投资增长乏力的问题,我省对消费的需求相对偏低,而对投资的需求则相对较大,今后","updated":"2022-02-08T11:56:17.041Z"}
{"corpusid":223326902,"openaccessinfo":{"externalids":{"MAG":"1024688039","ACL":null,"DOI":null,"PubMedCentral":null,"ArXiv":null},"license":null,"url":null,"status":null},"abstract":"教学不仅要让学生获得知识,更重要的是要培养和开发学生的智能.在素质教育的今天,人的能力的培养,是各学科重要的教学目标.历史学科做为中学教学的一门基础课程,不仅肩负着使学生拥有历史基本知识的重任,更要培养学生比较、分析、概括、归纳、演绎、鉴赏、阐释、推理历史的能力,塑造学生的历史思维和人生价值观.","updated":"2022-02-08T00:38:48.681Z"}
{"corpusid":194139549,"openaccessinfo":{"externalids":{"MAG":"2198285049","ACL":null,"DOI":null,"PubMedCentral":null,"ArXiv":null},"license":null,"url":null,"status":null},"abstract":"This research is for knowing larvasidae effect of kemangi leaves to house fly (Musca domestica). Kemangi leaves was refined by using steam destillation method which gain atsiri oil. This research was used 5 treatments (2,5%, 5%, 10%, 20% and control) and for every treatment was repeated for 4 times. The oil was mixed with aqudes till reach concentration 2,5%, 5%, 10% and 20%. For each repeat, it was using 25 third-instar house fly’s larvaes. The method of the research is Complete Random Device. Data of the research is analysed by using ANOVA and continued with Duncan's Multiple Range Test. The highest mortality (83%) and the lowest ability in ecdysis and eclosy (13 and 37%) reached on the highest concentration (20%). PENGARUH PEMBERIAN EKSTRAK KEMANGI (Ocimmum basilicum forma citratum) TERHADAP PERKEMBANGAN LARVA LALAT RUMAH","updated":"2022-02-08T08:16:30.543Z"}
{"corpusid":179872754,"openaccessinfo":{"externalids":{"MAG":"986331783","ACL":null,"DOI":null,"PubMedCentral":null,"ArXiv":null},"license":null,"url":null,"status":null},"abstract":"江泽民总书记在庆祝中国共产党成立七十周年大会上的重要讲话,是一篇领导全党和全国各族人民沿着建设有中国特色社会主义道路继续前进的纲领性文件。领会《讲话》精神,我们必须在以下四个方面统一认识:①当前国际形势风云变幻,世界社会主义事业遭受严重挫折,马克思主义受到挑战,在这关键时刻,江总书记重要讲话庄严宣告:中国共产党坚持高举马克思主义旗帜,坚持走建设有中国特色的社会主义道路,坚定不移地同国内外敌对势力的和平演变图谋作斗争,这是具有重大现实意义和深远历史意义的。②江泽民总书记在讲话中指出,中国共产党的七十年,是我们党日益发展壮大的七十年,是党领导中国人民开创历史新篇章的七十年,是马","updated":"2022-02-08T13:46:35.210Z"}
{"corpusid":199120414,"openaccessinfo":{"externalids":{"MAG":"2957028566","ACL":null,"DOI":null,"PubMedCentral":null,"ArXiv":null},"license":null,"url":null,"status":null},"abstract":"Tujuan dilakukannya penelitian ini yaitu untuk mengetahui bagaimanakah pandangan Undang-Undang Nomor 1 Tahun 1974 terhadap perkawinan anak dibawah umur dan bagaimanakah perkawinan anak dibawah umur ditinjau dari sudut pandang Hukum adat, yang dengan metode penelitian hukum normatif disimpulkan: 1. Perkawinan anak di bawah umur merupakan perkawinan anak yang tidak sesuai batas minimal yang diatur oleh Undang-Undang Nomor 1 Tahun 1974 Tentang Perkawainan yang lebih rinci diatur dalam Pasal 7 ayat (1), dimana usia seorang pria sudah mencapai 19 Tahun dan wanita sudah mencapai 16 tahun. Hal ini menandakan bahwa di dalam undang-undang ini tidak mengizinkan adanya perkawinan di bawah umur sesuai dengan ketentuan yang dimaksud. Namun dalam Undang-Undang ini ada bentuk pengecualian terhadap perkawinan di bawah umur, sesuai yang terdapat dalam Pasal 7 ayat (2), dimana perkawinan anak dibawah umur dapat dilakukan asalkan meminta dispensasi kepada pengadilan atau pejabat lain yang ditunjuk oleh kedua orang tua pihak pria maupun pihak wanita. 2. Perkawinan anak dibawah umur jika dilihat dari sudut pandang Hukum adat memberikan penegasan bahwa dalam Hukum adat tidak melarang adanya perkawinan anak dibawah umur, karena perkawinan dalam Hukum adat bukan hanya tentang kedua mempelai saja, akan tetapi dilihat juga  dari keluarga kedua belah pihak. Tujuan atau alasannya adalah untuk menjaga atau melangsungkan hubungan kekerabatan diantara pihak yang bersangkutan, sehingga menjaga jangan sampai diantara pihak pria atau pihak wanita lari dari proses hubungan kekerabatan yang sudah diperjanjikan. Dalam faktanya banyak proses perkawinan anak dibawah umur yang dilakukan dalam konteks masyarakat adat. Kata kunci: perkawinan anak; perkawinan; anak;","updated":"2022-02-08T05:51:30.308Z"}
{"corpusid":193809823,"openaccessinfo":{"externalids":{"MAG":"2621144916","ACL":null,"DOI":null,"PubMedCentral":null,"ArXiv":null},"license":null,"url":null,"status":null},"abstract":"Penelitian ini bertujuan untuk: 1) Mengetahui kondisi pariwisata di Kabupaten Klaten pada tahun 1998-2010. 2) Mengetahui perkembangan pariwisata di Kabupaten Klaten tahun 1998-2010. 3) Mengetahui pengaruh pariwisata di Kabupaten Klaten terhadap masyarakat sekitar tahun 1998-2010.Penelitian ini menggunakan metode historis yaitu heuristik, kritik sumber (kritik intern dan kritik ekstern), interpretasi dan historiografis. Sumber penelitian dikumpulkan melalui studi dokumen, arsip dan wawancara dengan para pelaku sejarah. Sumber primer yang digunakan antara lain arsip instansi pemerintah dan wawancara dengan Dinas Kebudayaan Pariwisata Pemuda dan Olahraga Kabupaten Klaten sebagai instansi yang terkait dengan penelitian yang telah dilaksanakan, serta melaksanakan wawancara dengan masyarakat yang terkait langsung dengan kepariwisatan di Kabupaten Klaten dan merasakan dampak yang ditimbulkan dengan adanya obyek pariwisata tersebut dalam periode tahun 1998-2010. Adapun sumber sekunder yang digunakan antara lain buku-buku referensi, artikel, serta penelitian terdahulu yang terkait tentang tema yang diambil.Hasil penelitian ini menunjukkan bahwa dinamika sektor pariwisata di Kabupaten Klaten mengalami perkembangan setelah adanya otonomi daerah pada tahun 2001, kepariwisataan Kabupaten Klaten mulai tertata dengan rapi. Pada tahun-tahun berikutnya mulai muncul program-program pemerintah untuk meningkatkan kepariwisataan di Kabupaten Klaten.Terbukti dengan peningkatan jumlah pengunjung di obyek-obyek wisata Kabupaten Klaten dari tahun ketahun. Pariwisata di Kabupaten Klaten memberikan pengaruh besar terhadap pemerintah, masyarakat sekitar serta pihak swasta. Berbagai pengaruh yang muncul diantaranya sebagai penyokong pendapatan asli daerah (PAD), pengaruh terhadap kehidupan sosial ekonomi, sosial budaya masyarakat sekitar, serta berpengaruh terhadap pihak swasta diantaranya tempat hiburan, hotel/penginapan, rumah makan, serta biro perjalanan. Pengaruh pariwisata dapat meningkatkan pendapatan masyarakat sekitar, seperti di obyek wisata OMAC dan Sunan Pandan Arang mayoritas pedagang berasal dari daerah sekitar obyek wisata.Kesimpulan yang dapat diampil adalah pada tahun 1998 terjadi peristiwa kerusuhan yang dikenal dengan kerusuhan Orde Baru. Peristiwa ini mengakibatkan dampak pada kepariwisataan di Kabupaten Klaten. Jumlah pengunjung yang mengalami penurunan. Kepariwisataan di Kabupaten Klaten pada tahun 1998 belum tertata dengan baik. Mulai tahun 2001 setelah adanya otonomi daerah kepariwisataan di Kabuaten Klaten mengalami penataan dan pembenahan. Pada tahun 2009 pariwisata di Kabupaten Klaten semakin berkembang dan bertambah jumlah pengunjung. Pada tahun 2009 hingga tahun 2010 perkembangan pariwisata di Kabupaten Klaten begitu nampak, hal ini dibuktikan dengan semakin berkembangnya obyek-obyek wisata yang ada di Kabupaten Klaten.","updated":"2022-02-08T08:18:48.097Z"}
{"corpusid":192946274,"openaccessinfo":{"externalids":{"MAG":"2352750925","ACL":null,"DOI":null,"PubMedCentral":null,"ArXiv":null},"license":null,"url":null,"status":null},"abstract":"A mourning dress is the formal costume that the mourners wear to show civility during the mourning. Traditional funeral rites are the Confucianism’s funeral proceeding where the mourners wear according to the National Mourning Dresses System. However, nowadays, the funeral proceedings and mourning dresses are simplified. In result of current design analysis of the mourning dresses for women, the types of the mourning dresses for women are classified by traditional styles and modern styles. Traditional styles include skits and Jeogori make of hemp fabrics, and modern styles include skits and Joegori style, modernized Hanbok style, and Western style, which consist of cardigan, waist skits, jackets, and pants. The modern styles mostly use polyester and the color consists mainly of black and white. The followings propose new designs of mourning dress for women that reflect practicality, flexibility, and diversity. First, transmit the meaning that traditional mourning dress entails Second, change the length and the width of Jeogori and skirt by reflecting the trend of the time and change the designs of the mourning dresses by using the details of the modern styles so that they are equipped with practicality, flexibility, and affordability. Third, pursue diversity by changing the uniformed fabrics and colors used on the existing mourning dresses. This study addresses the drawbacks and the points that need be improved to suggest the designs of the modern mourning dress for women, which reflect the characteristics of Hanbok and cultural traits.","updated":"2022-02-08T08:36:50.878Z"}
{"corpusid":156476161,"openaccessinfo":{"externalids":{"MAG":"2392122124","ACL":null,"DOI":null,"PubMedCentral":null,"ArXiv":null},"license":null,"url":null,"status":null},"abstract":"The process of preliminary examination is also called the process of examination before the court hearing, which is an important part in the process of criminal lawsuits. The essential purpose of its establishment is to prevent the groundless trail to the citizens and amputation to the continuity of the process of investigation and examination. The thesis analyzes some fundamentally theoretic problems such as the relation between the preliminary examination and the right of public prosecution, the character and function of the preliminary examination and the mode of preliminary examination in modern countries. The thesis thinks the preliminary examination is the effective restriction to the abuse of the right of public prosecution and it is a kind of judicial examination holding the function of protecting the basic human rights of the suspected and the defendant and improving the efficiency. The study of the preliminary examination will redound to the improvement of China's procedural system and push the criminal procedure to develop in a democratic and economical direction.","updated":"2022-02-09T00:46:24.399Z"}
{"corpusid":153028336,"openaccessinfo":{"externalids":{"MAG":"1495406097","ACL":null,"DOI":null,"PubMedCentral":null,"ArXiv":null},"license":null,"url":null,"status":null},"abstract":"This paper is an offshoot of research conducted in preparation for the University of Calgary History conference of 2014 focussing on new perspectives of the Great War.  My primary intent in that research was to explore the notion that air services were, using the recent educational concept of the Learning Organization, in fact precursors of this concept within a military context.  One of the conclusions I came to is that this learning was not just happening within the air services but took place even at the national, or grand strategic, level where decisions had to be made both about how to use this new means of warfare and about the allocation of resources while continuing to support the needs of the army and navy.  The former had to do with strategic bombing of enemy targets and the balance of this paper looks at how the concepts and practice of strategic bombing evolved in France, Germany and Britain.","updated":"2022-02-09T02:32:55.979Z"}
{"corpusid":158907902,"openaccessinfo":{"externalids":{"MAG":"2765757252","ACL":null,"DOI":null,"PubMedCentral":null,"ArXiv":null},"license":null,"url":null,"status":null},"abstract":"The principal aim of the article is to examine politics of sexuality in Croatia in 1990’s. Based on discourse analysis, the article aims to describe negotiations between the present and the past in building of national identity in 1990’s and its consequences. Contemporary politic of sexuality was influenced by what Stuart Hall calls ‘resources of history’ and scientific discourses which originate in late 19th century, but influence present social reality causing antagonisms, exclusions, marginalization.","updated":"2022-02-08T23:30:53.438Z"}
{"corpusid":191040148,"openaccessinfo":{"externalids":{"MAG":"1533243448","ACL":null,"DOI":null,"PubMedCentral":null,"ArXiv":null},"license":null,"url":null,"status":null},"abstract":"\"Ja vam deixar de ser, fa molt de temps, una societat de sistemes; ara deixem de ser una societat de comunicacio i ens estem transformant en una societat d'informacio. Aquest canvi tindra grans repercussions en tots els ambits. Afectara la cartografia, pero tambe en rebran les consequencies altres activitats humanes. Canviara fins i tot la nostra concepcio del mon\", ha declarat a ESPAIS Jaume Miranda, director de l'Institut Cartografic de Catalunya.","updated":"2022-02-08T09:11:15.569Z"}
{"corpusid":178199124,"openaccessinfo":{"externalids":{"MAG":"1565161885","ACL":null,"DOI":null,"PubMedCentral":null,"ArXiv":null},"license":null,"url":null,"status":null},"abstract":"“文质彬彬”既是儒家评价君子道德修养的一个标准，也是儒家对文章写作的审美追求。《论语》是儒家经典，思想内容博大精深，语言简朴生动，精炼形象，富于哲理和文学色彩，做到文质相谐，符彩相胜。这种文质彬彬具有典雅美的语言风格，在中国文学史上产生深远的影响。","updated":"2022-02-08T14:28:59.880Z"}
{"corpusid":177337648,"openaccessinfo":{"externalids":{"MAG":"927772121","ACL":null,"DOI":null,"PubMedCentral":null,"ArXiv":null},"license":null,"url":null,"status":null},"abstract":"上海国资国企在全市经济中占有重要地位，要努力成为技术创新的主力军，切实发挥支撑引领上海“创新驱动、转型发展”的作用。国资收益中，安排不低于30％的资金，用于支持企业主业核心关键技术创新和能级提升；绩效考核中，对承接重大项目，在自筹研发费用超过支持资金时，支持资金和自筹研发费用等视同于利润；人员激励中，对关键的科技骨干、创新团队及相关经营管理人员等实施奖励","updated":"2022-02-08T15:04:01.205Z"}
{"corpusid":148748314,"openaccessinfo":{"externalids":{"MAG":"2617343251","ACL":null,"DOI":null,"PubMedCentral":null,"ArXiv":null},"license":null,"url":null,"status":null},"abstract":"Penelitian ini bertujuan untuk mengetahui pengaruh kecerdasan emosional dan minat belajar terhadap tingkat pemahaman akuntansi dengan kepercayaan sebagai variabel pemoderasi. Jenis penelitian merupakan penelitian kuantitatif dengan menggunakan data primer. Teknik pengumpulan data adalah melalui penyebaran kuesioner. Populasi dalam penelitian ini yaitu mahasiswa S1 Akuntansi Universitas Pendidikan Ganesha yang saat ini sedang berada di semester 7 (tujuh) yang berjumlah 241 orang. Teknik pengambilan sampel menggunakan Non Probability Sampling dan dengan menggunakan rumus slovin sehingga diperoleh sample sebanyak 91 orang. Data dianalisis menggunakan regresi linear sederhana dan menggunakan Moderating Regression Analysis dengan bantuan software SPSS versi 24. \nHasil penelitian ini menunjukkan (1) kecerdasan emosional berpengaruh positif signifikan terhadap tingkat pemahaman akuntansi, (2) minat belajar berpengaruh positif signifikan terhadap tingkat pemahaman akuntansi, (3) kepercayaan diri memperlemah pengaruh antara kecerdasan emosional terhadap tingkat pemahaman akuntansi dan (4) kepercayaan diri memperlemah pengaruh antara minat elajar terhadap tingkat pemahaman akuntansi. Kata Kunci : Kecerdasan Emosional, Minat Belajar, Pemahaman Akuntansi, Kepercayaan Diri. This research aims at knowing the effect of emotional intelligence and learning interest toward the understanding level of accountancy with self-confidence as moderating variable. The kind of this research is qualitative by using primary data. The technique of collecting the data is by using questionnaire. The populations are the students of bachelor program of accountancy department Ganesha University of Education, who are in the seventh (VII) semester in the amount 241 people. The technique of taking the sample uses non probability sampling by choosing slovin formula so it gets sample as many as 91 people. The analysis data uses the analysis of simple linear regression and uses moderating regression analysis by assistance of SPSS software version 24. \nThe result of this research shows that (1) emotional intelligence has significant positive effect toward the understanding level of accountancy, (2) learning interest has significant positive effect toward the understanding level of accountancy, (3) self-confidence weakens the effect of emotional intelligence toward the understanding level of accountancy, (4) self-confidence weakens the effect of learning interest toward the understanding level of accountancy keyword : emotional intelligence, learning interest, understanding of accountancy, self-confidence.","updated":"2022-02-09T04:42:59.730Z"}
{"corpusid":171442060,"openaccessinfo":{"externalids":{"MAG":"2772784647","ACL":null,"DOI":null,"PubMedCentral":null,"ArXiv":null},"license":null,"url":null,"status":null},"abstract":"El projecte tracta de l'estudi aerodinamic d'un vehicle de Formula SAE. El que es preten \nes fer una comparacio entre el vehicle original i el vehicle amb el carenat modificat. \nAquesta modificacio consistira basicament en la incorporacio de dos components que \nprotegiran les rodes posteriors dels fluids que aquestes puguin rebre. \nAbans pero, sera necessari saber de quines parts esta format un vehicle de Formula \nSAE. \nUn cop fet l'estudi de l'aerodinamica del vehicle, primer sense les noves peces, i despres \namb aquestes, s'extrauran conclusions sobre si es beneficial o no per al cotxe la incorporacio \nd'aquests nous components.","updated":"2022-02-08T16:49:39.557Z"}
{"corpusid":167905642,"openaccessinfo":{"externalids":{"MAG":"2533720091","ACL":null,"DOI":null,"PubMedCentral":null,"ArXiv":null},"license":null,"url":null,"status":null},"abstract":"Celebrity marketing or celebrity endorsement has been effective marketing tool and this research is aim to apply the tool to tourism setting. Through literature review, fan`s awareness and likability toward celebrity were revealed as important variables that form favorable tourist attitude and visit intention. Effectiveness of destination marketing for destination is how to convert celebrity (potential endorser) Into endorser and fan (as potential tourist) into tourist and celebrity`s source credibility plays a important role. Narrowing the research scope down to Korean Hallyu celebrity and Japanese Hallyu fan around Hallyu tourism product, this model is expected to give a guidance in selecting effective Korea tourism ambassador and to suggest managerial implication to practitioners, especially for interested In celebrity driven-touism.","updated":"2022-02-08T18:43:17.057Z"}
{"corpusid":167941981,"openaccessinfo":{"externalids":{"MAG":"2386392943","ACL":null,"DOI":null,"PubMedCentral":null,"ArXiv":null},"license":null,"url":null,"status":null},"abstract":"By analyzing collegiate sport and community sport,a method to achieve complementarily and sharing of resources between collegiate sport and community sport is proposed.E.g.University sports facilities can be open to the public,university cultivates social sports instructors to serve the community and the community through excellent human resources as a part-time university teachers,coaches and tutors.Etc.These ways achieve resource sharing","updated":"2022-02-08T18:41:28.825Z"}
{"corpusid":157529684,"openaccessinfo":{"externalids":{"MAG":"2606370404","ACL":null,"DOI":null,"PubMedCentral":null,"ArXiv":null},"license":null,"url":null,"status":null},"abstract":"abstract: the subject of this note is the problem of equitable or fair division. we consider the simple case, where two individuals have to split a constant sum of money, say us-dollars 100, which they will get by reaching an agreement. the divisionshould satisfy both, in the sense that everyone considers his amount as a fair share. in welfare economics and game theory different rules or schemes were proposed to solve this problem. the most important of this fair division schemes are discussedin this paper. first we consider three rules, the kemeny solution, the nash solution, and the welfare solution, and compare this rules with the axioms of nash's bargaining problem. in the second part we give a new interpretation and a rigorous proofof a remarkable theorem of lerner. this rule is not consistent with the bargaining model of nash, because it involves uncertainty, whereas the first three refer to decisions under certainty.;","updated":"2022-02-09T00:11:43.656Z"}
{"corpusid":156620785,"openaccessinfo":{"externalids":{"MAG":"2382501966","ACL":null,"DOI":null,"PubMedCentral":null,"ArXiv":null},"license":null,"url":null,"status":null},"abstract":"In this paper,to disperse price asset,its option price is calculated by Law of One Price.Then,the price meaning and how to invest option are explained.","updated":"2022-02-09T00:41:14.015Z"}
{"corpusid":148049076,"openaccessinfo":{"externalids":{"MAG":"2383364592","ACL":null,"DOI":null,"PubMedCentral":null,"ArXiv":null},"license":null,"url":null,"status":null},"abstract":"Because of having had Shi Tie-sheng,the present age of Chinese literary circles looks like being not so shallow and showy.In the lively and exciting life place,he appears lonely and chilly fearing.But,he has carried out thorough and forceful interrogation,such as live and dead,bitter and happy,love and desire,incomplete and sound.Facing many ultimately and difficultly surviving position where human beings finding no way to get off,he thinks deeply with his life-strength,and guides a road to lead to an ideal paradise for us.","updated":"2022-02-09T05:06:16.006Z"}
{"corpusid":171384626,"openaccessinfo":{"externalids":{"MAG":"2560760505","ACL":null,"DOI":null,"PubMedCentral":null,"ArXiv":null},"license":null,"url":null,"status":null},"abstract":"A promulgacao da Constituicao Federal de 1988 trouxe a consolidacao da saude como um direito social a ser garantido de forma integral e universal pelo Estado. No entanto, como os cidadaos brasileiros enfrentam serio desafios para obter o direito a saude passaram a ter a prerrogativa de reivindica-lo em juizo, acionando legitimamente o Estado para a garantia de suas pretensoes sanitarias. E dito que a politica publica de saude do Brasil e permeada por contradicoes, sendo que, inclusive, o SUS e um sistema publico, universal, com principios e diretrizes iguais em todo o territorio nacional, mas que nao se efetivam de maneira uniforme. Diante deste contexto, os individuos sao obrigados a buscar alternativas para garantir seu direito a saude, sendo uma delas a judicializacao. O objetivo do presente trabalho e analisar as demandas na area de saude ajuizadas e sentenciadas em Florianopolis/SC entre os anos de 2012 e 2013. Trata-se de um estudo descritivo retrospectivo, cujo material de analise foram documentos das acoes judiciais. A coleta de dados foi realizada na sede da Procuradoria Geral do Estado de Santa Catarina (PGE SC). Do total de acoes ajuizadas e sentenciadas na area da saude em Florianopolis nos anos de 2012 e 2013, obteve-se uma amostra de 278 processos, que foram analisados na integra, atraves do sistema proprio da PGE SC, sendo que as informacoes obtidas foram inseridas em matrizes de dados. Observou-se que 91,4% das demandas sao individuais, sendo que 70,5% sao assistidas pela Defensoria Publica do Estado. Evidenciou-se que todas as acoes tem pedido liminar e destes 99,3% foram deferidos. Obteve-se que 76,3% das provas que embasam os pedidos sao provenientes do SUS e 80,6% das acoes sao ajuizadas contra o Estado. Os autores utilizam a Constituicao Federal, a Constituicao Estadual e a Lei 8.080/90 para embasar o pedido. Evidenciou-se que 73% dos processos foram julgados procedentes. Convem ressaltar que as decisoes dos magistrados fundamentam-se no dever do Estado em garantir integralmente a saude e na comprovacao do pedido, com base nas Constituicao Federal, bem como na Constituicao Estadual e na Lei 8.080/90. Conclui-se que a judicializacao nao deveria ser o caminho para viabilizar o acesso a saude, no entanto, se nao ha outro meio de obter um direito fundamental, e concebivel que estas demandas acontecam atraves do Poder Judiciario, ja que nao garantidas pela via administrativa. Grande parte dos itens postulados foi prescrita por medicos do SUS, ou seja, estao em conformidade com as diretrizes do Sistema Publico de Saude, porem, e a via judicial que as legitima. Deve-se considerar que muito embora a judicializacao seja capaz de atenuar o problema sobre o sistema de saude atual, por outro lado, pode se apresentar como um entrave na consolidacao da politica publica de saude prevista na Constituicao.","updated":"2022-02-08T16:51:28.823Z"}
{"corpusid":166762406,"openaccessinfo":{"externalids":{"MAG":"888986532","ACL":null,"DOI":null,"PubMedCentral":null,"ArXiv":null},"license":null,"url":null,"status":null},"abstract":"or epitome of title requisitions on title","updated":"2022-02-08T19:18:54.581Z"}
{"corpusid":194223912,"openaccessinfo":{"externalids":{"MAG":"2208930787","ACL":null,"DOI":null,"PubMedCentral":null,"ArXiv":null},"license":null,"url":null,"status":null},"abstract":"최근 여러 프로그램에서 자주 발견되는 자기성찰성은 일종의 포스트모더니즘의 텔레비전 문화양식에 해당한다. 연구자들은 이 자기성찰성의 새로운 문화현상을 텍스트와 텍스트의 상호 작용에 관한 문제의식인 상호텍스트성 개념과 연관시켜 이론화하고자 한다. 보다 정확하게, 상호텍스트성의 특수한 형태이자 내적인 형식의 텍스트 상호작용을 텍스트의 ‘자기성찰성’으로 정의한다. 텍스트 내적인 관계로서 자기성찰성은 텍스트의 자의식이자 스스로에 대한 반성적 인식의 표시이다. 단순한 자기 반영이나 자기 언급의 차원을 뛰어 넘는 자의식의 존재와 정도는 자기성찰적 텍스트 판별의 결정적인 척도가 된다. 이런 점에서 연구자들은 ‘자기성찰성’을 텍스트적 규범과 평가의 문제까지 끌어낼 수 있는 매우 정치적이고 실천적인 개념으로 파악한다. 현재 한국 텔레비전에서 차용되는 자기 반영, 자기 언급의 테크닉들에 대해 비판적으로 살펴본 후, 나르시시즘의 한계를 넘어 진정한 자기성찰의 문화정치적 잠재성이 실현되도록 하기 위한 급진적 이론화의 제언으로 결론을 맺는다.","updated":"2022-02-08T08:16:06.031Z"}
{"corpusid":193232495,"openaccessinfo":{"externalids":{"MAG":"1799040161","ACL":null,"DOI":null,"PubMedCentral":null,"ArXiv":null},"license":null,"url":null,"status":null},"abstract":"본 논문에서는 1930년대부터 1960년대까지 미국과 스칸디나비아에서 주로 나타난 유기적 모더니즘 가구디자인의 조형적 특성에 대하여 연구하고자 하며 그 과정으로써 1910년대부터 약 50년에 걸쳐 나타나는 현대미술의 유기적 조형성과의 상호연관성을 도출해 보고자 한다. 이를 통해 자연과 인간과의 관계를 중요시하는 인본주의에 기반 한 유기적 조형성의 의의를 되짚어보고자 하며 오늘날 다시 화두가 되고 있는 가구디자인에 있어서의 유기적 조형세계를 이해하고 발전시키는데 필요한 자료로 활용하고자 한다.","updated":"2022-02-08T08:28:26.260Z"}
{"corpusid":149900010,"openaccessinfo":{"externalids":{"MAG":"2896102024","ACL":null,"DOI":null,"PubMedCentral":null,"ArXiv":null},"license":null,"url":null,"status":null},"abstract":"ABSTRACT Winarno (K4613149). IMPROVEMENT EFFORTS OF LEARNING THROUGH LONG JUMP SQUAT STYLE APPROACH TO PLAY IN CLASS VII B SMP NEGERI 8 SURAKARTA IN ACADEMIC YEARS 2017/2018. Thesis, Faculty of Teacher Education. Sebelas Maret University of Surakarta. June 2018. The purpose of this research is to improve learning outcomes in the long jump squat style class VII B SMP Negeri 8 Surakarta in academic year 2017/2018. This study is a classroom action research (PTK) conducted in two cycles, and each cycle consists of 2 meetings. Research subjects of students of class VII B, amounting to 32 students. The data source comes from students, teachers, and researchers. Data collection techniques use tests and observations. Data validity is by using data triangulation technique. Data analysis used qualitative descriptive analysis technique using percentage technique. The results of data analysis showed an increase learning outcomes long jump squat style as follows. The percentage of completeness in the pre-cycles is 31.25% or 10 students, unfinished 68.75% or 22 students. The percentage of completeness in the first cycle is 46.88% or 15 students, untargets 53.12% or 17 students. While on the percentage of completeness in the second cycle is 81.25% or 26 students, untargets 18.75% or 6 students. Learning outcomes long jump squat style has reached a target attainment of 80%. Based on the analysis above it can be concluded; that the application of the method of approach play can improve learning outcomes in the long jump squat style class VII B SMP Negeri 8 Surakarta in academic year 2017/2018. Keywords: Learning outcomes, Style Long Jump Squat, Playing Approach Implementation Method.","updated":"2022-02-09T04:08:07.365Z"}
{"corpusid":146264872,"openaccessinfo":{"externalids":{"MAG":"2936792988","ACL":null,"DOI":null,"PubMedCentral":null,"ArXiv":null},"license":null,"url":null,"status":null},"abstract":"The invention discloses a semiconductor device and a manufacturing method therefor, and an electronic apparatus. The manufacturing method comprises the steps of a) providing a semiconductor substrate with a pseudo-gate structure; b) forming an interlayer dielectric layer, and filling gaps among the pseudo-gate structures; c) removing the pseudo-gate structures to form a trench; d) forming an interface layer at the bottom of the trench, and forming a high-k dielectric layer and a capping layer on the side wall of the trench and the top of the interface layer in sequence; e) forming a barrier layer and a first work function setting metal layer on the capping layer in sequence; f) removing the first work function setting metal layer from an NMOS region; and g) forming a second work function setting metal layer and a metal gate material layer in the trench in sequence, wherein a processing step of enabling the second work function setting metal layer to fully cover a channel region of the NMOS region is implemented in any one, two, three or all the steps of between the step a) and b), between the step d) and e), between the step e) and f), and between the step f) and g) optionally. According to the manufacturing method, the up-wrapping of the NMOS work function can be avoided.","updated":"2022-02-09T06:01:23.846Z"}
{"corpusid":146044493,"openaccessinfo":{"externalids":{"MAG":"2938014892","ACL":null,"DOI":null,"PubMedCentral":null,"ArXiv":null},"license":null,"url":null,"status":null},"abstract":"The invention provides an electric seat adjusting method and system and a vehicle. The electric seat adjusting method includes the steps that a current adjusting mode of an electric seat is collected, and adjusting modes include the high-speed/long-distance mode, the congestion/ downtown mode, the rugged/bumpy mode, the ramp mode and the automatic mode; current state values of preset parameters used for representing a vehicle state are collected; the current state values are compared with a seat state value range of the current adjusting mode to obtain a comparison result; according to the comparison result, when the current state values are in the seat state value range, corresponding correction of current moment is obtained; the correction of the current moment is processed to obtain a result value; the electric seat is adjusted according to the result value. According to the provided scheme, the posture of the electric seat is automatically corrected, the adjusted seat enables a driver to be in a more comfortable and safer sitting posture appropriately, and the problem that because traffic conditions of roads are complex, the driver is fatigued and discomforted to cause misoperation is solved.","updated":"2022-02-09T06:08:29.979Z"}
{"corpusid":145988653,"openaccessinfo":{"externalids":{"MAG":"2938506629","ACL":null,"DOI":null,"PubMedCentral":null,"ArXiv":null},"license":null,"url":null,"status":null},"abstract":"The invention belongs to the technical field of enzyme treatment, and particularly relates to a method for enhancing the stability of preserved neutral protease. The method comprises the steps that a stabilizer-anhydrous calcium chloride, sorbitol and potassium sorbate are added into the neutral protease, and then the neutral protease is preserved at a certain pH value and temperature. By adopting the method, the stability of the neutral protease can be significantly enhanced. According to the method, the stabilizer-anhydrous calcium chloride, sorbitol and potassium sorbate are added into the neutral protease to enhance the stability of the neutral protease, the pH value of the neutral protease into which the stabilizer is added is regulated, then the neutral protease mixed material is preserved in the environment at the temperature of 25 DEG C or below, and the residual rate of enzyme activity of the neutral protease is 90% or above.","updated":"2022-02-09T06:09:46.118Z"}
{"corpusid":145834697,"openaccessinfo":{"externalids":{"MAG":"2937353949","ACL":null,"DOI":null,"PubMedCentral":null,"ArXiv":null},"license":null,"url":null,"status":null},"abstract":"La presente invention concerne un procede pour lutter contre des micro-organismes phytopathogenes par traitement de la culture a proteger, du sol ou du materiau de propagation des plantes avec une quantite efficace de particules de sels de cuivre qui comprennent un polymere soluble dans l'eau et qui ont un diametre de particule primaire de 1 a 200 nm. L'invention concerne aussi une suspension aqueuse des particules de sels de cuivre susmentionnees et l'utilisation de cette suspension dans la protection des cultures.","updated":"2022-02-09T06:18:35.106Z"}
{"corpusid":142016989,"openaccessinfo":{"externalids":{"MAG":"628184801","ACL":null,"DOI":null,"PubMedCentral":null,"ArXiv":null},"license":null,"url":null,"status":null},"abstract":"Tujuan penelitian ini adalah untuk: (1) mengetahui penggunaan media blok dienes dapat memudahkan pemahaman siswa dalam pembelajaran matematika; (2) mengetahui penggunaan media blok dienes dalam meningkatkan prestasi belajar matematika. \nVariebel yang menjadi sasaran perubahan dalam penelitian tindakan kelas ini adalah hasil belajar Matematika, sedangkan variable tindakan yang digunakan dalam penelitian ini adalah pembelajaran menggunakan media blok dienes. \nBentuk penelitian ini adalah penelitian tindakan kelas dengan menggunakan model siklus. Tiap siklus terdiri dari empat tahapan, yaitu: perencanaan, pelaksanaan tindakan, observasi, dan refleksi. Sebagai sampel adalah siswa kelas II SDN Jatisobo 01 yang berjumlah 15 anak. Teknik pengumpulan data variabel peningkatan hasil belajar Matematika melalui pembelajaran menggunakan media blok dienes digunakan teknik observasi, pencatatan arsip, tes. Teknis analisis data yang digunakan adalah model analisis interaktif yang mempunyai tiga buah komponen yaitu reduksi data, sajian data, dan penarikan kesimpulan. \nBerdasarkan hasil penelitian hasil belajar dapat disimpulkan bahwa tindakan kelas pada siklus I menunjukkan adanya peningkatan hasil belajar nilai tempat, nilai rata-rata siswa mencapai 7,33 dengan prosentase siswa yang memperoleh nilai > 6,0 sebanyak 100% dan untuk materi penjumlahan nilai rata-rata siswa mencapai 7,13 dengan prosentase siswa yang memperoleh nilai > 6,0 sebanyak 86,6%. sedangkan untuk materi pengurangan yang diulang pada siklus II menunjukkan peningkatan yang cukup berarti. Semula nilai rata-rata pengurangan pada siklus I hanya 6,26 pada akhir siklus II nilai rata-ratanya mencapai 6,93 dengan prosentase siswa yang memperoleh nilai di atas 6,0 sebanyak 93,33%. Kemudian dilanjutkan siklus III dengan alasan peningkatan nilai dari siklus I ke siklus II belum begitu signifikan dan untuk mengetahui efektifitas penggunaan media blok dienes. Berdasarkan hasil siklus III diperoleh adanya peningkatan hasil belajar nilai tempat, nilai rata-rata siswa mencapai 7,73 dengan prosentase siswa yang memperoleh nilai > 6,0 sebanyak 100% dan untuk materi penjumlahan nilai rata-rata siswa mencapai 7,93 dengan prosentase siswa yang memperoleh nilai >6,0 sebanyak 100%, untuk materi pengurangan juga mengalami peningkatan dengan nilai rata-rata siswa mencapai 7,26 dengan prosentase siswa yang memperoleh nilai > 6,0 sebanyak 100%. Dengan demikian, dapat diajukan suatu rekomendasi yang diutamakan kepada guru kelas rendah agar dalam menggunakan media blok dienes dalam pembelajaran Matematika sebagai upaya meningkatkan hasil belajar Matematika pada siswa kelas II SDN Jatisobo 01 Kecamatan Polokarto Kabupaten Sukoharjo Tahun Pelajaran 2009/2010.","updated":"2022-02-09T08:16:22.423Z"}
{"corpusid":141203278,"openaccessinfo":{"externalids":{"MAG":"216941833","ACL":null,"DOI":null,"PubMedCentral":null,"ArXiv":null},"license":null,"url":null,"status":null},"abstract":"Few if any of the greatest ideas now available to guide school practice are totally new, Mr. Anderson reminds us. But their rediscovery and reapplication seem to be essential first steps if we are to rescue the schooling enterprise from a variety of disasters. OLDER READERS may remember the sacred song by Sir Arthur Sullivan in which an organist sadly remembers accidentally hitting a presumably perfect chord and laments that he has not been able to find that chord again. Lately I have been reflecting on our tendency in education to relive the experience of that frustrated organist. We are conscientious workers who have also hit some pretty good chords over the years in our work with children, but somehow we haven't been able to recapture that music and build a (pedagogical) symphony around it. Inherent in the above comment is the fact that few if any of the greatest ideas now available to guide school practice are totally new. Most of them have been weaving in and out of our consciousness for many years, but somehow many of them have become lost or distorted. Their rediscovery and reapplication seem to be essential first steps in whatever reform, revolution, or reversal of our backsliding may now seem to be needed if we are to rescue the schooling enterprise from a variety of disasters. It may be that most of the \"lost\" chords in education simply fell on the wrong ears at the wrong time. They probably weren't perfect when they were first sounded - except by contrast with the surrounding cacophony - but they had vitality and inherent beauty. It was mostly their loneliness that prevented them from taking hold. To play a useful role, these chords needed to join with others in some coherent theme or structure. A good idea here, another good idea there, and still others from earlier or later in history - all require artful assembly and then expert application. One of the interesting features of the education scene at the end of the century is that some lost or misplaced chords from the past are now being combined in many kinds of change efforts. And the main ideas inherent in them are proving to be quite coherent or at least mutually compatible. It seems significant that there are not many proposals among the so-called restructuring reforms that are actually in conflict. Within the \"quality movement,\" for example, there are few proposals that fail to mesh with other concepts of restructuring. Within the many proposals for attaining equity in the schools and even within proposals for dealing seriously with the \"basics,\" there are only occasional underlying inconsistencies or dissonances. These assertions might surprise those whose careers are geared to pushing a particular brand of reform idea, but, as I survey the current reform scene, I see a great deal of common ground, and I sense that there are a great many common beliefs and values on which a positive future can be built. I see, for example, that there is an amazing theoretical consensus to the effect that the rigid graded structure of schools - with its attendant dependence on tests and textbooks and its reliance on extrinsic motivational devices - must be drastically overhauled. I see overwhelming evidence that self-containment, in any professional role, is recognized as less desirable than collegial arrangements; that classrooms must become busy, active, and thus occasionally noisy environments; that pupils should rarely if ever be permanently grouped according to handicap or giftedness or age; that the curriculum must no longer be strictly compartmentalized and therefore incoherent; that high expectations should exist for all kinds of children; and that participation in decision making on the part of all players (students, teachers, administrators, parents, community people, and so on) is not only essential but workable. And these are only a few examples of the wonderful music that we could play together. Recently I have been working with groups of headmasters and teachers in Sweden, focusing on elementary school structuring. …","updated":"2022-02-09T08:41:55.023Z"}
{"corpusid":139659849,"openaccessinfo":{"externalids":{"MAG":"2759085235","ACL":null,"DOI":null,"PubMedCentral":null,"ArXiv":null},"license":null,"url":null,"status":null},"abstract":"The present invention relates to a surface-treated steel sheet, which is mainly characterized in that the corrosion-resistant coating comprising at least one surface of a steel sheet, the film is a film having adhesiveness in the corrosion, the corrosion-resistant film is selected from Ni layer, Sn layer, Fe-Ni alloy layer, Fe-Sn alloy layer and a Fe-Ni-Sn alloy layer is at least one layer, the adhesive coating containing Zr, further comprising the mass ratio of Zr with respect to the Total count of at least one metal element selected from 0.01 to 10 Co, Fe, Ni, V, Cu, Mn, and Zn. The surface-treated steel sheet having excellent wet resin adhesion and corrosion resistance, streaky surface defects do not exist. Thus, the surface-treated steel sheet may be coated with the resin having excellent properties of the resin-coated steel. Further, by using the method for producing surface-treated steel sheet without using stringent environmental restrictions Cr.","updated":"2022-02-09T09:27:03.597Z"}
{"corpusid":139309389,"openaccessinfo":{"externalids":{"MAG":"2887218516","ACL":null,"DOI":null,"PubMedCentral":null,"ArXiv":null},"license":null,"url":null,"status":null},"abstract":"A passageway having a stack (122, 132) of the fuse structure BEOL (BOEL). Channels (122, 132) results in a stack of high aspect ratio, such that the liner and cover channel Seeds worse. Lining (124) seed layer leads to weakening and electromigration (EM) higher probability of failure. The fuse structure due to the failure to resolve the difference between the liner and seed coverage caused. Design feature allows to determine where the failure occurs, it is determined by the extent of damage after the fuse programming area and to prevent further spread of damage dielectric region.","updated":"2022-02-09T09:37:27.014Z"}
{"corpusid":127449123,"openaccessinfo":{"externalids":{"MAG":"175771773","ACL":null,"DOI":null,"PubMedCentral":null,"ArXiv":null},"license":null,"url":null,"status":null},"abstract":"Due to significant requirement of trained personnel in Fish Health Management, the Aquaculture Department of the Southeast Asian Fisheries Development Center (SEAFDEC/AQD) offered 14 sessions of face-to-face (F2F) training (1988–2002) at its station in Iloilo. However, shrinking fellowship and travel funds necessitated a shift in training paradigm. Thus, transformation of teaching materials used in F2F trainings resulted to AquaHealth Online, a team developed and electronically delivered course on Health Management in Aquaculture. The general objective of the course transformation was to train a large pool of geographically dispersed participants at minimum cost, and this paper reports on the experience earned in course development, delivery and outcome. To enable Fish Health specialists to develop materials and skills to deliver courses for the online environment, SEAFDEC/AQD collaborated with the University of the Philippines Open University to help adapt, enhance, and reformulate materials in the F2F course for online delivery. The specialists underwent hours of training in “techno-pedagogy”, or ways of transforming teaching activities into formats that could be understood even in our absence. The primary learning resource is a CD-ROM that provides interactive information with self-assessment questions. The course covers 12 modules in 4 units:","updated":"2022-02-09T15:53:50.674Z"}
{"corpusid":126654519,"openaccessinfo":{"externalids":{"MAG":"128937653","ACL":null,"DOI":null,"PubMedCentral":null,"ArXiv":null},"license":null,"url":null,"status":null},"abstract":"Au Mexique, au 18 eme siecle, la vitesse de circulation monetaire est lente car il n'existe pas de banque. Les emissions monetaires ne concernent principalement que des pieces de haute valeur. Le stock monetaire se retrouve entre les mains de quelques personnes (essentiellement des marchands). Le principal credit etait celui destine a la consommation alors que les lettres de change sont peu importantes. Alors qu'en campagne, la monnaie est absente, en ville elle est trop grosse et oblige chaque commercant a « frapper sa monnaie » en donnant une fiche donnant le droit d'acheter telle ou telle marchandise dans son commerce","updated":"2022-02-09T16:08:47.674Z"}
{"corpusid":126619501,"openaccessinfo":{"externalids":{"MAG":"2918530622","ACL":null,"DOI":null,"PubMedCentral":null,"ArXiv":null},"license":null,"url":null,"status":null},"abstract":"U ovom radu napravljena je web aplikacija za suradnicko oblikovanje komponenata grafickog jezika. Korisnik može izraditi komponente pomocu osnovni","updated":"2022-02-09T16:11:45.768Z"}
{"corpusid":123932891,"openaccessinfo":{"externalids":{"MAG":"2393010347","ACL":null,"DOI":null,"PubMedCentral":null,"ArXiv":null},"license":null,"url":null,"status":null},"abstract":"Though the combination forecasting problems with forecast values and actual values are interval numbers,in this paper,we talk about the forecasting which is use the correlation coefficient.Correlation coefficient is describe the relative between two intervals.And in the follow parts,we give a new method to get the result.Finally,we use a numerical example to describe this combination forecasting method effectiveness and feasibility.","updated":"2022-02-09T18:33:03.252Z"}
{"corpusid":125615904,"openaccessinfo":{"externalids":{"MAG":"2895290025","ACL":null,"DOI":null,"PubMedCentral":null,"ArXiv":null},"license":null,"url":null,"status":null},"abstract":"The invention discloses an illuminating cover and an illuminating device. The illuminating cover comprises an illuminating cover main body which covers a light source; and one side of the illuminating cover main body which faces or is opposite to the light source is provided with irregular recesses and bumps. Light is irregular under the refracting action of the recesses and bumps, so that the seepage rate is not lost greatly, and the diffusivity of light can be fully realized. By adopting the illuminating cover and the illuminating device disclosed by the invention, the high permeability of light can be realized while the diffusivity of light is fully realized.","updated":"2022-02-09T16:40:19.124Z"}
{"corpusid":125483703,"openaccessinfo":{"externalids":{"MAG":"2548429580","ACL":null,"DOI":null,"PubMedCentral":null,"ArXiv":null},"license":null,"url":null,"status":null},"abstract":"Let {X9 jf) be a harmonic space in the sense of H. Bauer's address. This report is devoted to exposition of some things one can say, and questions one can ask, about X and ffl from the standpoints of topology, functional analysis, and sheaf theory. While it will seem that potential theory does not appear explicitly and probabil­ istic considerations are absent, one should keep in mind W. Hansen's work [13] showing that the operators we shall examine are either semigroup generators or","updated":"2022-02-09T16:44:44.596Z"}
{"corpusid":124297568,"openaccessinfo":{"externalids":{"MAG":"2391878529","ACL":null,"DOI":null,"PubMedCentral":null,"ArXiv":null},"license":null,"url":null,"status":null},"abstract":"Aiming at the image encryption,a kind of image grouping encryption algorithm based on logistic mapping and z-mapping is put forward. In each iteration of this algorithm,the matrix scrambling,the nonlinear numerical replacement and the numeral value iteration are alternately used. By a large number of experimental verification,this algorithm can effectively resist plaintext attack,differential attack and statistical analysis,and it has larger key space and higher security,and the speed of encryption and decryption is quite fast,which is suitable for data storage.","updated":"2022-02-09T18:30:22.954Z"}
{"corpusid":134451231,"openaccessinfo":{"externalids":{"MAG":"2923156853","ACL":null,"DOI":null,"PubMedCentral":null,"ArXiv":null},"license":null,"url":null,"status":null},"abstract":"Drive lines slip joint assembly is coupled to telescopic an internal bore through the slip yoke having an internal spline part of a face center axis having a spline extending radially inwardly, and one end of the slip yoke and a spline extending radially outwardly from the central axis one takes the form with a yoke shaft having a spline portion having external. Yoke shaft and engaged with the spline of the slip yoke yoke shaft and how between the slip yoke for forming a driving connection, forms a drive line slip joint assembly and coat one of the spline of the yoke shaft or slip yoke parts of low friction coatings , and heat the yoke shaft and slip yoke to a temperature sufficient to soften parts of the low-friction coating, aligning the center of the yoke shaft with respect to the slip yoke, and inserting the yoke shaft in the internal bore of the slip yoke, cool the yoke shaft and slip yoke It involves.","updated":"2022-02-09T12:11:19.620Z"}
{"corpusid":133042386,"openaccessinfo":{"externalids":{"MAG":"2929416269","ACL":null,"DOI":null,"PubMedCentral":null,"ArXiv":null},"license":null,"url":null,"status":null},"abstract":"A gas delivery system that provides positive airway pressure therapy. A mask couples to a patient's face to deliver pressurized gas to an airway of the patient. The mask includes a flow generator system disposed on the mask and that pressurizes the gas, the flow generator including at least one motor. A controller controls the at least one motor.","updated":"2022-02-09T12:50:48.489Z"}
{"corpusid":131404812,"openaccessinfo":{"externalids":{"MAG":"2360125455","ACL":null,"DOI":null,"PubMedCentral":null,"ArXiv":null},"license":null,"url":null,"status":null},"abstract":"For reservoirs with high rock brittleness coefficient and uniform development of natural fractures,three basic modes are developed to characterize fracture network created by volume fracturing in horizontal wells. Flow from reservoir to wellbore is divided to two parts: reservoir flow and network flow. Principle of potential superposition is used to derive reservoir flow equation. Finitedifference method is adopted to establish flow equation within finite conductivity network. Star-Delta transformation is used to tackle interplay of flow between hydraulic and natural fractures. A comprehensive flow model is presented by coupling matrix equations of two flows. It indicates that as stimulated horizontal length is kept constant,effect of quantity of fracture stages and perforation clusters in each stage on production is more significant than that of half-length and flow conductivity of hydraulic fracture,which is,in turn,more dominant than that of density and flow conductivity of natural fractures. Finally,a field example shows that little difference exists between measured and calculated results.","updated":"2022-02-09T13:50:51.935Z"}
{"corpusid":137347639,"openaccessinfo":{"externalids":{"MAG":"164132490","ACL":null,"DOI":null,"PubMedCentral":null,"ArXiv":null},"license":null,"url":null,"status":null},"abstract":"Thermally efficient dryers were needed to remove 11-12% moisture from very fine (70%, -325 mesh), copper concentrate at Asarco, Inc., in Hayden, AZ. More than 128 t/hr of the wet, dust-like material produced by the copper mine's grinders had to be made bone dry (0.1% moisture) before being fed to a flash smelting furnace. Two 12 ft diam fluidized bed dryers, each with a capacity of 64 wet t/hr, were installed to dry the copper concentrate. Each dryer's push/pull air system employs a 1250 hp fluidizing air fan to provide air at 80 in (wc) static pressure. A natural gas fired heater raises the air temperature to 600/sup 0/F to dry the dense (100 lb/cu ft bulk density) ore. The dense, wet copper concentrate is fed to the dryer from the top, countercurrent to the flow of the light, dry product. Drying begins when the wet feed reaches the fluidized bed of gravel rock. Lighter, dried material is conveyed by the air back to the top of the dryer and out through a duct to the baghouse. The throughput of the dryer is determined by the wetness of the concentrate and the temperature of the fluidizing air. Asarco, Inc. hasmore » found the fluid bed drying system simple and efficient to operate. Fuel gas consumption of the dryer is on the order of 1000 cu ft/ton of wet feed. The abrasion resistant lining provided in the dryer (a hard brick lining in the rock bed zone; castable refractory in the top and in the ducting) and ceramic tiles at the inlet of the dust collector have been effective in long term operation with the highly abrasive product.« less","updated":"2022-02-09T10:40:35.238Z"}
{"corpusid":134932100,"openaccessinfo":{"externalids":{"MAG":"2753737646","ACL":null,"DOI":null,"PubMedCentral":null,"ArXiv":null},"license":null,"url":null,"status":null},"abstract":"Teorija i praksa digitalizacije i nove, digitalne kulturne bastine razvijaju se posljednjih nekoliko desetljeca kao interdisciplinarno podrucje koje povezuje kulturnu bastinu, nove medije, strucnjake iz razlicitih disciplina i bastinskih zajednica te korisnike. Ovaj rad bavi se teorijskim i prakticnim pitanjima komunikacije kulturne bastine u digitalnom obliku sa sadržajno-korisnickog aspekta. Sredisnja tema rada je modeliranje digitalnih zbirki i digitalnih proizvoda na temelju fizickih bastinskih zbirki i s njima povezanih znanja. Definiraju se i opisuju organizacijski i sadržajni modeli digitalnih bastinskih zbirki te modeli digitalnih bastinskih proizvoda: mrežnih stranica bastinskih ustanova, online zbirki, virtualnih izložbi i multimedijskih prica kao vec ustaljenih kiberžanrova. Na primjerima izvedenih autorskih projekata argumentiraju se teorijska polazista, ideje i koncepti te ukazuje na probleme i izazove s kojima se susrecemo kad želimo iskoristiti reproduktivne i produktivne potencijale novih medija i korisnicima ponuditi nove doživljaje kulturne bastine. Prema predloženom modelu vrednovanja, koji ukljucuje i UNESCO-ove stupove ucenja, istražuje se hrvatski bastinski online prostor buduci da do danas nije objavljena slicna cjelovita studija. Svi rezultati istraživanja pohranjeni su u posebno razvijenoj bazi podataka Hrvatska kulturna bastina online, koja se kontinuirano održava i ažurira. Postavlja se pitanje kako komuniciramo kulturnu bastinu putem world wide weba i koliko hrvatske bastinske zajednice doprinose razvoju drustva znanja. Usporedna studija temeljnih hrvatskih bastinskih ustanova – državnih arhiva, narodnih knjižnica i muzeja pokazuje njihova postignuca u online prostoru. Iako posljednjih nekoliko godina na tom podrucju postoje znacajni pozitivni pomaci, Hrvatska je jos uvijek u pocetnoj fazi razvoja online bastinskog okruženja koje bi korisnicima pružilo kvalitetne sadržaje i razuman okvir za e-ucenje. Novi mediji i mrežno okruženje nisu znatnije utjecali na procese digitalne konvergencije u hrvatskim bastinskim zajednicama. Na kraju se iznose rezultati istraživanja korisnika bastinskih mrežnih stranica kako bi se stekao uvid u njihove potrebe i ocekivanja. Istraživanje pokazuje kako postoji povezanost između ucestalosti koristenja bastinskih mrežnih stranica i fizickog posjecivanja bastinskih ustanova.","updated":"2022-02-09T11:56:34.987Z"}
{"corpusid":133571189,"openaccessinfo":{"externalids":{"MAG":"2933920482","ACL":null,"DOI":null,"PubMedCentral":null,"ArXiv":null},"license":null,"url":null,"status":null},"abstract":"In one embodiment, the photovoltaic cell frame assembly (100) includes a frame having a photovoltaic module (102) and a plurality of vent holes (112). Vent pores (112), and allows air to flow into the frame, thereby the photovoltaic cell module (102) is cooled. The frame is one that enables the flow of air between them frames mounted in series with another such frame. Vent pores (112) may be located within the perimeter of the frame so as to realize the left structural integrity maintaining aesthetic appearance. The frame, in order to provide a choice on different mounting for adaptation to different locations, can include internal lips, external lip, or both. The frame can be composed of a plurality of frame members such projections including a vent (112). .The","updated":"2022-02-09T12:34:32.154Z"}
{"corpusid":131371631,"openaccessinfo":{"externalids":{"MAG":"2338354820","ACL":null,"DOI":null,"PubMedCentral":null,"ArXiv":null},"license":null,"url":null,"status":null},"abstract":"An apparent natural introduction and establishment of a population of Anopheles walkeri into an ecological research site is documented. Likelihood of introduction by human activity is discussed. In mid-August a series of trapping and alighting/biting studies was resumed. Trap sets were oriented with the fan intake at ca. 0.75 m above ground level with the outlet of a sucrose/ yeast CO2 generator at ,0.4 m above ground directed upward just beyond the edge of the collecting bag. These low settings were devised to maximize the likelihood that any adults collected would not be attracted from a distance. Three specimens of An. walkeri were taken in alighting/ biting counts on August 16 and a single specimen was taken from a light and CO2 trap, 4 specimens from a light and CO2 trap on August 28, and 46 specimens from a CO2-only trap on September 18.","updated":"2022-02-09T13:51:16.844Z"}
{"corpusid":131264373,"openaccessinfo":{"externalids":{"MAG":"2354228639","ACL":null,"DOI":null,"PubMedCentral":null,"ArXiv":null},"license":null,"url":null,"status":null},"abstract":"According the investigation and analysis on the municipal refuse of Shijiazhuang city,the Vegetative Rubbish has accounted for more than 50% of the total amount of the municipal refuses.It not only helps to lower the cost of municipal refuse Incineration and enhances rubbish recycle,but also promotes the value of the rubbish and lower the environment damage of Rubbish treatment.The Vegetative Rubbish belongs to the nonpoisonous,harmless rubbish.If disposal the Vegetative Residential Rubbish by different categories and use the fermented recycle method of marsh gas,the disposal rubbish cost will decline and the utilization of marsh gas will create more profit.","updated":"2022-02-09T13:51:53.932Z"}
{"corpusid":131585032,"openaccessinfo":{"externalids":{"MAG":"2373345179","ACL":null,"DOI":null,"PubMedCentral":null,"ArXiv":null},"license":null,"url":null,"status":null},"abstract":"This piece gives a thorough illustration of the problems about the research on Chinese Shan Hai Jing.It briefly reviews the rough process of the research and the scientific level it has seached at,describes the present situation,its meaning,and its prospect,pointing out that the research will finally result in greater contributions to makind.","updated":"2022-02-09T13:48:02.558Z"}
{"corpusid":130581695,"openaccessinfo":{"externalids":{"MAG":"2252480654","ACL":null,"DOI":null,"PubMedCentral":null,"ArXiv":null},"license":null,"url":null,"status":null},"abstract":"최근 CASE도구의 통합방법의 하나로서 공통된 정보저장소(Repository)를 두어서 여러 도구들이 생성하고 사용하는 정보를 일괄 관리할 뿐 아니라 소프트웨어 생명주기 전체를 지원할 수 있도록 각 도구간의 유기적 결합을 유도하고 있다. CASE 정보저장소는 각 도구간의 정보를 공유할 수 있게 함은 물론 저장정보의 형태와 의미, 그 운용 방법 등에 관한 공통된 틈을 제공하는 메타모델을 지원한다. 정보저장소간의 정보 교환뿐 아니라 CASE 도구간의 통합을 가능하게 하기 위하여 정보저장소의 표준화가 중요하며, IRDS(Information Resource Dictionary System)는 이러한 표준화 노력의 하나로서 메타모델의 확장 및 전체 생명주기 지원기능, 시스템간의 메타데이타의 교환을 가능케한다. 본 논문에서는 CASE 정보저장소로서 IRDS의 활용 가능성을 보이기 위해 구조적 방법론에 근거한 시스템 요구분석 단계를 중심으로 정보저장소의 메타모델을 IRDS 모델링 기능을 이용하여 정의하고, 실제 저장정보의 예로서 요구 분석단계의 산출들인 자료흐름(DFD)를 가지고 적용해 보인다. 끝으로 CASE 도구와 IRDS의 인터페이스를 위해 구조적 분석 지원도구인 'START(STructured Analysis and Reporting Tool)'에서 지원하는 요구명세 편집기능이 IRDS명령어로 어떻게 전환될 수 있는가를 보인다.","updated":"2022-02-09T14:07:21.975Z"}
{"corpusid":114138029,"openaccessinfo":{"externalids":{"MAG":"2416969297","ACL":null,"DOI":null,"PubMedCentral":null,"ArXiv":null},"license":null,"url":null,"status":null},"abstract":"Sengon (Paraserianthes falcataria (L) Nielsen) is known as one of the fast growing tree species. The trees are grown on many forest and particularly community forest in Java Island. One of the efforts to increase the supply of the wood has been done by harvesting the trees in a shorter rotation. Another effort has also been done by growing the trees originated from the shoot (off-shoot trees) instead of those originated from its seeds (seed trees). Visual observation indicates that off-shoot trees show a better growth than those of seed trees, a comparison has therefore been done by studying the physical and mechanical properties of wood from trees of two different regeneration systems. This study has been done by using wood from seed trees (seed-wood) and from off-shoot trees (off-shoot¬wood) of 7 years old of the same site on Wonosobo regency. Wood samples in the free branch stem were divided based on three different radial and axial positions. The wood samples were prepared and measured according to British Standard Methods BS 373. Data obtained from the measurement were analyzed by analysis of variance using a factorial experiment in Completely Randomized Design. The result indicated that although most of the physical and mechanical properties of the wood produced by off-shoot trees were higher than seed trees but the analysis of variance shows that regeneration system only significantly affects green moisture content (GMC) and modulus of elasticity (MOE) of the wood. Interaction between regeneration system and radial position affect air-dry radial shrinkage and total longitudinal shrinkage. Seed trees produced wood of higher GMC (105.48%) than off-shoot trees (76.73%), but having MOE of only 36.57 x 1000 kg/cm2 which is significantly lower than off-shoot trees of 40.34 x 1000 kg/cm2. They show a non significant air dry moisture content (AMC) of 12.77% for seed trees and of 12.83% for off-shoot trees. Both regeneration systems produced rather low average green specific gravity (SG) of only 0.226, and show low and equal average total radial and longitudinal shrinkages of 2.66% and 0.26% respectively, while its average total tangential shrinkage is 4.69% for seed trees and 4.97% for off shoot trees. Both regeneration systems also show low T/R ratio of 1.78 for seed tree and 1.86 for off shoot tree. Sengon trees produced average MOR, compression strength II to grain, and compression strength Y\" to grain of 325.68 kg/cm2, 200.84 kg/cm2, and 200.84 kg/cm? respectively.","updated":"2022-02-10T01:50:07.493Z"}
{"corpusid":113244266,"openaccessinfo":{"externalids":{"MAG":"2356734114","ACL":null,"DOI":null,"PubMedCentral":null,"ArXiv":null},"license":null,"url":null,"status":null},"abstract":"A compound die including blanking,drawing and punching procedure was introduced.The die changes traditional way of multi-procedure manufacturing,reducing manufacturing cost and improving product quality and manufacturing efficiency.","updated":"2022-02-10T02:35:35.324Z"}
{"corpusid":112589246,"openaccessinfo":{"externalids":{"MAG":"2377261951","ACL":null,"DOI":null,"PubMedCentral":null,"ArXiv":null},"license":null,"url":null,"status":null},"abstract":"A heat-transfer model of platen superheater of CFB boilers has been established in this paper.Based on heating calculation in sections for tubes on 3 typical loads,the steam temperature and the wall temperature distribution along the tubes have been presented. The change of heat-transfer coefficient for platen heating surface in different load is investigated according to the operation parameters. The cause of overheating of the platen superheater in low load is also analyzed in this paper. The results show that the heat transfer flux is well-distributed for platen superheater,but the highest wall temperature is appearing under the 75% BMCR load.","updated":"2022-02-10T03:10:45.207Z"}
{"corpusid":112296580,"openaccessinfo":{"externalids":{"MAG":"2248058940","ACL":null,"DOI":null,"PubMedCentral":null,"ArXiv":null},"license":null,"url":null,"status":null},"abstract":"从发生主义语言观和连接主义理性学习理论出发，以一所师范院校英语专业学生为例，运用问卷调查及准历时研究的方法考察中国英语学习者是否存在石化现象。问卷调查结果显示中国英语学习者的中介语在所被调查的6个英语特征方面存在石化现象。准历时研究以四年级学生和二年级学生分别作为历时研究的两个端点，通过比较两组学生中介语中的4个英语结构的发展情况，发现四年级学生在2年的时间里，被调查的4个英语结构没有得到发展，因此得出存在石化现象的证据。问卷调查结果和准历时研究的发现丰富了石化现象研究的理论依据，对指导语言教学实践活动具有现实意义。","updated":"2022-02-10T03:26:35.168Z"}
{"corpusid":111437484,"openaccessinfo":{"externalids":{"MAG":"2336952456","ACL":null,"DOI":null,"PubMedCentral":null,"ArXiv":null},"license":null,"url":null,"status":null},"abstract":"nucleation. Even though there are experimental studies aimed at understanding the basic mechanisms, the observed complexity is very difficult to interpret, with many controlled variables affecting the pitting process. In general, the corrosion damage modeling shouldinvolvenotonlyphysicochemicalandenvironmentalfactors, but also various parameters, random in nature. Therefore, a more realistic computational corrosion damage model should integrate various parameters that are random in nature from electrochemistry, materials science, and probability and statistics. In contrast to mechanistic approaches, computational modeling of pitting corrosion based on local rules with evolving patterns may open up the possibility of getting insight into pitting corrosion from a different point of view. Recently, Pidaparti et al. [15] developed a two-dimensional model for studying pitting corrosion growth based on the cellular automata (CA) approach. However, they did not consider the initiation phase of pitting corrosion in their model. The main objective of this work is to develop an approach to modeling three-dimensional surface-corrosion-damage initiation and growth using specific rules governing the electrochemical reactionsinacellularautomataenvironment.Theresultsofcorrosion damage growth obtained from the three-dimensional model are compared with the experimental data obtained from the Center for MaterialsDiagnosticsattheUniversityofDaytonResearchInstitute.","updated":"2022-02-10T04:11:22.804Z"}
{"corpusid":109154854,"openaccessinfo":{"externalids":{"MAG":"2924268060","ACL":null,"DOI":null,"PubMedCentral":null,"ArXiv":null},"license":null,"url":null,"status":null},"abstract":"A polymer containing a structural unit represented by formula (A). In formula (A), each P represents a group represented by formula (P). L represents a linking group. a represents an integer between 2 and 5, inclusive, and b represents an integer between 0 and 5, inclusive. In formula (P), each A represents a nitrogen atom or CR. X represents a single bond, O, S, C(R) 2 , or NR. Each R independently represents a hydrogen atom, a substituted or unsubstituted C1-20 alkyl group and the like, or a single bond used in the bond to another P or L. However, at least one R in (P)a is represented by one of formulas (3)-(7).","updated":"2022-02-10T06:28:27.572Z"}
{"corpusid":108526931,"openaccessinfo":{"externalids":{"MAG":"2923363617","ACL":null,"DOI":null,"PubMedCentral":null,"ArXiv":null},"license":null,"url":null,"status":null},"abstract":"L'invention concerne un procede de traitement des dechets par pyrolyse par plasma, qui comprend les etapes consistant a : fournir une source thermique de plasma dans une chambre de reaction dans laquelle un materiau a traiter est loge ; generer du monoxyde de carbone et de l'oxygene en fournissant un agent de gazeification dans la chambre de reaction ; et realiser une pyrolyse de l'oxygene genere et du materiau a traiter, le materiau a traiter contenant du carbone, la temperature interieure de la chambre de reaction etant maintenue a environ 950 °C ou plus, et l'agent de gazeification comprenant du dioxyde de carbone, de l'azote et de l'argon dans un rapport d'environ 1:0,1-1:0,1-0,5 en volume.","updated":"2022-02-10T07:01:31.516Z"}
{"corpusid":82995936,"openaccessinfo":{"externalids":{"MAG":"187153003","ACL":null,"DOI":null,"PubMedCentral":null,"ArXiv":null},"license":null,"url":null,"status":null},"abstract":"We evaluated the effect of exposure to constant light started at the age of 1 month and at the age of 14 months on the survival, life span and age-related dynamics of activity antioxidant enzymes and level of a-tocopherol in various organs in comparison to the rats maintained at the standard (12: 12) light/dark regimen. The exposure to constant light started at the age of 14 months delayed aging of enzymatic and non-enzymatic component of antioxidant defence system that, probably, is one of the reasons of prolongation of a life span of animals. Circadian disruption induced by light-at-night started at the age of 1 month accelerates aging.","updated":"2022-02-11T01:31:19.449Z"}
{"corpusid":85650463,"openaccessinfo":{"externalids":{"MAG":"2145944680","ACL":null,"DOI":null,"PubMedCentral":null,"ArXiv":null},"license":null,"url":null,"status":null},"abstract":"The Argonaute protein family consists of two distinct sub-clades: AGO and PIWI proteins. AGO proteins can form RNA induced silencing complex (RISC) and are responsible for RNAi and miRNA pathways. PIWI proteins are mostly expressed in the germline and together with specific small RNA groups, named PIWI-interacting RNAs (piRNAs), they function in a germline-specific RNAi-like pathway. PIWI proteins are responsible for piRNA biogenesis and germline development/ function in many species. Zebrafish genome encodes two PIWI proteins: Ziwi and Zili. Loss of Ziwi or Zili function, leads to sterility and transposon de-repression in the germline. PIWI proteins in various species have been reported to interact with a special protein family, Tudor domain containing (Tdrd) proteins. Tdrd mutants often phenocopy piwi mutants, suggesting their roles in the PIWI-piRNA pathway. Tdrd proteins interact with proteins with methylated arginine residues in the RG motifs, which are also found in the N-terminus of PIWI proteins. Via reverse genetic screening, we obtained mutant zebrafish alleles in tdrd1, tdrd6 and tdrd9 genes. These three tdrd genes are germline-specific. We found that these three tdrd proteins are involved in the piRNA functions to different extent. Tdrd1 function as a scaffold to facilitate the piRNA pathway by recruiting PIWI proteins and their targets. Tdrd9 is important in maintaining the germ meiotic stem cells. Tdrd6 is a possible reservoir for Ziwi-specific piRNAs and assisting Ziwi targeting retrotransposons. Moreover, Tdrd6 is involved in germ plasm assembly in the early stage of embryogenesis.","updated":"2022-02-10T23:05:59.708Z"}
{"corpusid":85554801,"openaccessinfo":{"externalids":{"MAG":null,"ACL":null,"DOI":null,"PubMedCentral":null,"ArXiv":null},"license":null,"url":null,"status":null},"abstract":"This study aims to explore how CSR can serve as an influencing factor within interfirm relationships, more specifically, within the business relationship between a professional service company and their B2B-customers. CSR is a major topic in businesses today and has consequently become an elementary factor for organizations to implement in their strategies. Moreover, relationships have always been central to any business and even more today due to the heightened competition on the global market. This case study was directed upon investigating whether a specific CSR initiative taken by a professional service company, more specifically a Swedish bank, influences the relationships with its B2B-customers. CSR can be used in varying meanings and settings, however, this study is solely focused upon the societal dimension of CSR, as the chosen bank conducts the CSR initiative as a way of helping young unemployed adults. The purpose of this study was to gain an in-depth understanding about the bank’s B2Bcustomer relationships, in order to explore and investigate whether the CSR initiative in any way influences the relationships. We did not aim at generalizing our findings, rather, we aimed at examining underlying patterns and perceptions within a specific social context. In order to meet the purpose, seven interviews with representatives from the bank and their B2B-customers were conducted. The research question that we aim to answer, is as follows: How does a CSR initiative of a professional service company influence the relationship with its B2B-customers? It was found that the B2B-customers did not perceive the CSR initiative as influencing their total relationship with the bank, rather, they viewed it as a positive addition which improved the bank’s overall offer. However, some of the B2B-customers perceived an improvement in the bank’s service quality as a consequence of the CSR initiative. This was mainly due to the enhanced interaction with the bank and the additional services that were offered to the B2B-customers via the CSR initiative. From these empirical findings and the main theories used within this study, CSR and relationship marketing, an analysis model was derived. Although this model was applied within a CSR context, it holds the potential to be applied to other relationship influencing factors. Hence, future researchers are suggested to elaborate on this model.","updated":"2022-02-10T23:08:48.260Z"}
{"corpusid":80304632,"openaccessinfo":{"externalids":{"MAG":"2610903579","ACL":null,"DOI":null,"PubMedCentral":null,"ArXiv":null},"license":null,"url":null,"status":null},"abstract":"This research which was undertaken in Mungwi aimed at assessing the communication strategies which the Mungwi District AIDS Task Force has been using to combat the spread of HIV and AIDS in the district. The title of the research is, communication strategies used in HIV and AIDS prevention by the Mungwi District AIDS Task Force (DATF): A Case Study of Mungwi rural. The researcher intended to determine the extent to which Mungwi DATF communication on HIV and AIDS has impacted on people’s attitudes, beliefs and behaviour with regard to HIV and AIDS prevention and if possible provide further recommendations.\n\nIt is evident enough that the problem of HIV and AIDS has not spared anyone and as such it requires collective efforts to reduce the infection rates to zero. Although both recent reports by UNAIDS and Zambia country report on HIV and AIDS of 2010 indicates signs of success in the fight against the further progression of the HIV and AIDS epidemic as noticed in the reduction in the new HIV infections globally, there is still more work needed to be done because the present formal known HIV prevalence rate estimated at 14.3% is a high figure for Zambia (National AIDS Strategic Framework, 2011-2015, Towards Improving the quality of life of the Zambian people, 2010, p.1).\n\nIn order to obtain data the researcher used both qualitative and quantitative research methods. Several other methods were used such as the audience survey, staff survey, focus group interviews, in depth interviews, purposive sampling, cluster sampling, quota sampling and participant observation. The software package for social sciences was used to analyse data and triangulation was used.\n\nThe results are that there are differences in terms of knowledge on HIV and AIDS between those who live in Mungwi central and those in far distant places. Due to the vastness of the district coupled with little financial resources, Mungwi DATF fails to cover the whole area in its sensitisation pragrammes. It is for this reason that many people in Mungwi rural do not know much about DATF and have not been involved in its programmes. On the other hand, Mungwi DATF staff indicated that they have sensitised some areas on HIV and AIDS through radio programmes, meetings, workshops, events such as world AIDS day commemoration, posters, brochures, pamphlets and popular theatre.\n\nEven if this may be the case, much of the information on HIV and AIDS was said to come from other sources like palliative care, health personnel who visit communities providing antenatal services to the pregnant women and during child health week vaccination campaigns. Some of it is tapped from ZNBC radios 1 and 2. The researcher recommends that Mungwi DATF staff should visit and sensitise people on HIV and AIDS. Further recommendations are that Mungwi DATF should make more use of the radio, train more people who in turn would train others, print HIV and AIDS information in the local language on many utensils, involve both traditional and church leadership, produce DVDs on HIV and AIDS and…","updated":"2022-02-11T03:12:48.738Z"}
{"corpusid":76473456,"openaccessinfo":{"externalids":{"MAG":"2350574293","ACL":null,"DOI":null,"PubMedCentral":null,"ArXiv":null},"license":null,"url":null,"status":null},"abstract":"Objective To generally analyze the current situations and advancement of the study on immunotherapy for colorectal cancer. Methods The pertinent published papers about the current situation and research advancement of the immunotherapy of colorectal cancer were retrospectively investigated. And also the immunogenicity and the varying principles of immunoresistance, the functional targets, the practicality, and some other characteristics of different immunotherapy for colorectal cancer were reviewed. Results The main treatments and the research focuses in the immunotherapy of colorectal cancer are initiative nonspecific immunotherapy, adoptive immunotherapy, monoclonal antibody immunotherapy, initiative specific immunotherapy, and targeted therapy. They work by fighting against the cancer itself, cutting off the tumor’s nutrition supply, activating the immune system specifically or breaking the immune tolerance and so on. Though there are still many problems unsolved, immunotherapy has a promising clinical prospect. Conclusion As a beneficial complement for surgery, chemotherapy and radiotherapy, immunotherapy plays an important auxiliary role in the combined therapy for colorectal cancer.","updated":"2022-02-11T06:20:38.887Z"}
{"corpusid":74008197,"openaccessinfo":{"externalids":{"MAG":"2233208257","ACL":null,"DOI":null,"PubMedCentral":null,"ArXiv":null},"license":null,"url":null,"status":null},"abstract":"..................................................................................................................... 4 CONTENTS ...................................................................................................................... 6 ORIGINAL PUBLICATIONS .............................................................................................. 9 ABBREVIATIONS........................................................................................................... 10","updated":"2022-02-11T08:28:30.794Z"}
{"corpusid":73719627,"openaccessinfo":{"externalids":{"MAG":"1719894560","ACL":null,"DOI":null,"PubMedCentral":null,"ArXiv":null},"license":null,"url":null,"status":null},"abstract":"Bioaerosols containing pathogenic microorganisms can have health implications when respired. Of special concern are potential bioterrorism attacks conducted by deliberate aerosolization of hazardo ...","updated":"2022-02-11T08:47:08.330Z"}
{"corpusid":73811730,"openaccessinfo":{"externalids":{"MAG":"2186591372","ACL":null,"DOI":null,"PubMedCentral":null,"ArXiv":null},"license":null,"url":null,"status":null},"abstract":"Objective: To assess the effect of intraoperative ketamine in preventing post-anesthetic shivering. Methods: Eighty patients classified by the American society of anesthesiologists as class 2 and 3, scheduled for elective trans urethral resection of prostate under general anesthesia, were included in this study. Patients were assigned in a random manner to be given normal saline 0.9% as a placebo (group 1, n =37) or ketamine 25mg intravenously (group 2, n = 43) at the end of surgery prior to laryngeal mask airway removal. An anesthetist graded post- anesthetic shivering using a 5- point scale. Results: The two groups did not differ significantly regarding patients demographics. Ketamine significantly reduced the incidence and severity of post-anesthetic shivering in comparison with placebo, on arrival in the recovery room and at regular intervals postoperatively. Conclusion: Our results suggest that intraoperative ketamine is effective in the prevention of post- anesthetic shivering.","updated":"2022-02-11T08:41:31.597Z"}
{"corpusid":107440103,"openaccessinfo":{"externalids":{"MAG":"187830939","ACL":null,"DOI":null,"PubMedCentral":null,"ArXiv":null},"license":null,"url":null,"status":null},"abstract":"Inspection of nuclear power components has always presented difficulties to the nondestructive testing (NDT) industry from a time consumption and radiation exposure standpoint. Recent advances in computerized NDT equipment have improved the situation to some extent; however, the need for high reliability, precision, reproducibility, and clear permanent documentation are indispensable requirements that can only be met by automatic inspection and recording systems. The Savannah River Plant's inspection program of over 1000 IGSCC-susceptible welds is one of the most complete in the country and offers educational insight into ultrasonic examination technology of thin-wall stainless steel pipe welds.","updated":"2022-02-10T07:48:28.530Z"}
{"corpusid":107857923,"openaccessinfo":{"externalids":{"MAG":"192580946","ACL":null,"DOI":null,"PubMedCentral":null,"ArXiv":null},"license":null,"url":null,"status":null},"abstract":"The article considers the main features of teaching of the Latin language, which is a classic element of law education. The author analyzes the importance of the Latin language for professional activity of the future lawyers and substantiates the methods, contributing to the most effective mastering of language structures.","updated":"2022-02-10T07:33:38.839Z"}
{"corpusid":102838127,"openaccessinfo":{"externalids":{"MAG":"2805186372","ACL":null,"DOI":null,"PubMedCentral":null,"ArXiv":null},"license":null,"url":null,"status":null},"abstract":"PROCEDE D'AGGLOMERTION D'UN LATEX, LATEX AGGLOMERE OBTENU ET SON APPLICATION A LA MODIFICATION DE MATRICES THERMO-PLASTIQUES POUR LES RENDRE RESISTANTES AU CHOC A B R E G E On realise l'agglomeration d'un latex de polymere choisi parmi les elastomeres et les resines thermoplas-tiques, en effectuant le melange du latex a agglomerer avec un latex agglomerant forme de : (A) un polymere choisi parmi les elastomeres et les resines thermoplastiques ; et (B) un agent tensio-actif non-ionique consistant en un polymere sequence comportant au moins une sequence polyoxyethylene et au moins une sequence d'un polymere choisi parmi les polymeres vinyliques, dieniques, d'esters acryliques et methacryliques, ledit latex agglomerant etant obtenu par la synthese du polymere defini sous (A) au cours de laquelle (B) a ete utilise comme tensio-actif. Parmi les agents tensio-actifs (B), on peut citer le polymere trisequence polyoxyethylene-polystyrene-polyoxyethylene.","updated":"2022-02-10T09:36:13.668Z"}
{"corpusid":100348456,"openaccessinfo":{"externalids":{"MAG":"2474493956","ACL":null,"DOI":null,"PubMedCentral":null,"ArXiv":null},"license":null,"url":null,"status":null},"abstract":"The thermoluminescence of undoped and Mn-doped ZnF 2 was investigated at the dopant concentration of 1.5 % mole Mn after y - ray irradiation at room temperature. The glow curve from undoped ZnF 2 presents two peaks centered at 86°C and 273°C, while the ZnF 2 :Mn presents two peaks located at higher temperatures (325°C and 365°C), whose height ratio is modified with dose. The dose responses and fading process were also examined. The radiative thermostimulated recombination was found to be of the second kinetic order based on the geometric factor calculation. The trap parameters were obtained as activation energy and frequency factor.","updated":"2022-02-10T11:12:19.187Z"}
{"corpusid":99952280,"openaccessinfo":{"externalids":{"MAG":"2393709808","ACL":null,"DOI":null,"PubMedCentral":null,"ArXiv":null},"license":null,"url":null,"status":null},"abstract":"A realtime holographic interferometer and a simulator for liquidliquid diffusion were specially designed and constructed in order to measure liquid diffusivity in transparent fluids.As comparing the diffusivities of 0.33 mol/L KCl aqueous solution at temperature 25 ℃ were determined experimentally to verify the accuracy and reliability of the instrument,the determined results are at good agreement with ones in literature and validate the experimental setup.Furthermore,the diffusion coefficients of Lascorbic acid at 25 ℃ and under 5 various concentrations (0.010 0?0.028 7?0.054 2?0.082 2?0.100 7 mol/L) and different positions were measured respectively,and worked out average diffusion coefficients of 5 various concentrations:13.555 2,12.523 0,11.457 7,10.560 6,10.014 8×10-6 cm2/s.","updated":"2022-02-10T11:28:36.645Z"}
{"corpusid":89225234,"openaccessinfo":{"externalids":{"MAG":"2507048100","ACL":null,"DOI":null,"PubMedCentral":null,"ArXiv":null},"license":null,"url":null,"status":null},"abstract":"Recherche dans des populations d'Amerique du Nord de la transmission hereditaire maternelle de la resistance a la simazine, ainsi qu'a d'autres herbicides du groupe des triazines","updated":"2022-02-10T19:50:10.350Z"}
{"corpusid":99424216,"openaccessinfo":{"externalids":{"MAG":"2599639479","ACL":null,"DOI":null,"PubMedCentral":null,"ArXiv":null},"license":null,"url":null,"status":null},"abstract":"Phase equilibria in the Bi-Sb-Sn and In-Sb-Sn ternary systems have been determined experimentally as well as by using the CALPHAD (calculation of phase equilibria) method.","updated":"2022-02-10T11:47:50.062Z"}
{"corpusid":94034557,"openaccessinfo":{"externalids":{"MAG":"1638981340","ACL":null,"DOI":null,"PubMedCentral":null,"ArXiv":null},"license":null,"url":null,"status":null},"abstract":"Results are systematized from investigations of binary organic crystal systems with respect to the geometric and packing model of the molecular crystal. The existence of two types of solid solutions, true and interblock, is established experimentally. Instances of positional and orientational ordering of an impurity and the role of the molecular polarity and intermolecular H-bonds are analyzed. Inclusion solid solutions are formed in polymer-low-molecular-weight impurity systems. Factors such as the dense joint packing of two types of molecules also play a decisive role for systems in which a new phase, a molecular complex, is formed","updated":"2022-02-10T16:37:44.543Z"}
{"corpusid":89546736,"openaccessinfo":{"externalids":{"MAG":"2462830948","ACL":null,"DOI":null,"PubMedCentral":null,"ArXiv":null},"license":null,"url":null,"status":null},"abstract":"Some data on the specific features of the clinical course of acute enteric infections (AKI) and hypertensive disease (HD) are presented. The data indicate that the pathogenetic mechanisms of these diseases often act on the same points and in some cases in the same direction. 32,448 AEI patients were placed under observation, among them 29,398 patients with alimentary toxicoinfections and 3,050 patients with salmonellosis. Of these 1,483 patients had HD of stages II and III. In 266 patients of this group hypertensive crises of types I and II developed. In 128 AEI patients acute disturbances in cerebral blood circulation were observed. In 67.2% of cases these patients were found to have HD in their medical history. The treatment of patients with the combination of AEI and HD included rehydration with polyionic crystalloid solutions and the administration of hypotensive preparations.","updated":"2022-02-10T19:33:47.630Z"}
{"corpusid":107541927,"openaccessinfo":{"externalids":{"MAG":"169147733","ACL":null,"DOI":null,"PubMedCentral":null,"ArXiv":null},"license":null,"url":null,"status":null},"abstract":"A portion of a paper presented at the 1948 Indiana District Water Works Meetings by Henry B. Steeg, Cons. Engr., H. B. Steeg & Assoc, Indianapolis, Ind. Reprinted from the April 1949 issue ( Vol. 8, No. 1) of The Waterspout by permission of the Indiana State Board of Health, Although prepared for an Indiana audience, it is believed that the procedure described in this paper, and in the accompanying Discussion, has general application to water utilities throughout the United States.","updated":"2022-02-10T07:38:42.435Z"}
{"corpusid":88468440,"openaccessinfo":{"externalids":{"MAG":"2352549624","ACL":null,"DOI":null,"PubMedCentral":null,"ArXiv":null},"license":null,"url":null,"status":null},"abstract":"To question the reason of co localization of hDaxx and PML in PODs disrupted by Adenovirus(Ad) E1B 55 kilodalton oncoproteins(Ad E1B 55kD), the interaction of Ad E1B 55kD with hDaxx was analyzed by the yeast two hybrid assay, and the direct binding of Ad E1B 55kD with hDaxx was studied by coimmunoprecipitation reaction \\%in vivo\\% or \\%in vitro\\%. The results show that Ad E1B 55kD oncoproteins interact with hDaxx by binding the C terminus 58 amino acids of Ad2 E1B 55kD or the full length of Ad12 E1B 55kD. Ad2/5 or Ad12 E1B 55kD directly binds hDaxx \\%in vivo\\% or \\%in vitro.\\%","updated":"2022-02-10T20:27:28.600Z"}
{"corpusid":70705348,"openaccessinfo":{"externalids":{"MAG":"1184336612","ACL":null,"DOI":null,"PubMedCentral":null,"ArXiv":null},"license":null,"url":null,"status":null},"abstract":"Thimerosal is a preservative for vaccine production. Actual amount adding in the vaccine is critically considered. The method for determination of thimerosal content used presently in the Division of Biological Products is complicated and costly. Therefore the new method presented by Shrivastaw and Singh was validated by testing for linearity and range, precision, and accuracy. The linearity of thimerosal ranging from 2-10 mcg/ml was seen when performed the test at OD 538 nm. The correlation coefficient of OD values and thimerosal contents was 0.9997. For repeatability test and reproducibility test, the SD was low. Over 95 % recovery was noticed at all amount of thimerosal added in 5 vaccines. The determination of thimerosal in 5 types of vaccine, 5 lots for each type indicated that the amount detected by new method showed a good correlation to the traditional method with the confidential level at 99.9% and the thimerosal content appeared closely to the actual amount added in the vaccine production steps. This method also offers several advantages such as require small amount of vaccine, save the reagents and time, many samples can be tested at the same time and easy to carry out. Conclusion: this method is simple, accurate, precise and sensitive. It should be further used as a method for determination of thimerosal content in vaccine by the Division of Biological Products, Department of Medical Sciences. Keywords : thimerosal, preservative, vaccine, Spectrophotometry","updated":"2022-02-11T11:22:34.785Z"}
{"corpusid":70490508,"openaccessinfo":{"externalids":{"MAG":"1920763926","ACL":null,"DOI":null,"PubMedCentral":null,"ArXiv":null},"license":null,"url":null,"status":null},"abstract":"In healthy people without a coagulopathy or who are not treated by anti-coagulant, appearance of a femoral neuropathy due to the pressure exerted by an iliac hematoma is very rare. Most of the cases are young individuals in whom iliac muscle is tearing during sporting, which causes bleeding from the intramuscular vessels ending up with an iliac hematoma which exerts pressure on the neighboring femoral nerve through iliac fascia. Pressure is usually on the inguinal ligament level. All the clinical symptomatology regarding a pure femoral nerve lesion is apparent. To achieve femoral nerve decompensation, inguinal ligament must be dissected and the hematoma must be drained.","updated":"2022-02-11T11:32:49.092Z"}
{"corpusid":63673897,"openaccessinfo":{"externalids":{"MAG":"2363199656","ACL":null,"DOI":null,"PubMedCentral":null,"ArXiv":null},"license":null,"url":null,"status":null},"abstract":"This paper looks into the transliteration of Mandarin loanwords of English from Optimality Theo-ry perspective and concludes that such strategies as epenthesis,deletion and feature change are employed to satisfy Mandarin syllable structure. Meanwhile,faithfulness and markedness constraints interact with each other to present the sound changing process of syllable system.","updated":"2022-02-11T13:47:48.932Z"}
